{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### i0u19a - Data Processing - KU Leuven\n",
    "\n",
    "# Python Neo4j exercises\n",
    "\n",
    "###### _Jan Aerts_\n",
    "\n",
    "![license](https://licensebuttons.net/l/by/3.0/88x31.png)\n",
    "\n",
    "Hello and welcome to the tutorial on data processing with **Neo4j**!\n",
    "Before proceeding, make sure to have the neo4j server running as well, e.g with `docker run -d -p 7474:7474 jandot/neo4j-i0u19a`\n",
    "\n",
    "We'll be using Jupyter notebook again (you're looking at it) as a tool to walk you through a few examples. At the VDA-Lab, we like notebooks as a teaching tool because they allow you to experiment with code and data as you work your way through the document.\n",
    "\n",
    "A few guidelines on the notebook itself:\n",
    "* A notebook consists of *cells*, which are snippets of either text (markdown) or code (Python in this case).\n",
    "* Cells can be executed by clicking the `[>]` \"play\" button, or by hitting shift-enter on the keyboard.\n",
    "* You can navigate between cells either by clicking or by using the arrow buttons."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Neo4j documentation\n",
    "\n",
    "Check the general Neo4j documentation [here](http://neo4j.com/docs/stable/).\n",
    "\n",
    "py2neo API documentation: [http://py2neo.org/2.0/essentials.html](http://py2neo.org/2.0/essentials.html)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# The data\n",
    "The dataset consists of gene-gene and gene-disease interactions. Gene nodes have the type `:Gene`; disease nodes are of type `:Disease`. Gene-gene relationships are of type `:INTERACTS_WITH`; gene-disease relationships of type `:AFFECTS`.\n",
    "\n",
    "Node and relationship properties:\n",
    "* gene nodes: geneId, name\n",
    "* disease nodes: diseaseId, name\n",
    "* gene-gene relationships: nr_proofs, proofs\n",
    "* gene-disease relationships: score, associationType"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 1. Querying the data using the browser\n",
    "The neo4j database has a good web interface that you can use to look at the data. It can be reached on port 7474: [http://192.168.99.100:7474](http://192.168.99.100:7474) (as always: change the IP if necessary). It looks like this:\n",
    "![screenshot_browser](images/screenshot_browser.png)\n",
    "\n",
    "Data can be queried using the CYPHER language. See [here](http://neo4j.com/developer/cypher-query-language/) for a tutorial. Some quick example queries:\n",
    "\n",
    "* Get 5 nodes: `MATCH (n) RETURN n LIMIT 5;`\n",
    "* Get number of nodes with 2 incoming links: `MATCH ()-->(m)<--() RETURN COUNT(m);`\n",
    "\n",
    "To get things working a bit faster, let's create some indexes on the name fields. Run the following commands in the browser query field:\n",
    "* `CREATE INDEX ON :Gene(name);`\n",
    "* `CREATE INDEX ON :Disease(name);`"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Exercises\n",
    "* Fetch 3 diseases from the database.\n",
    "* What is the number of diseases in the database?\n",
    "* Find the number of paths between genes of length 2.\n",
    "* Which diseases are directly affected by the gene CRISP3?\n",
    "* What is the shortest path between the genes CRISP3 and ADAM22?\n",
    "* What are the 3 gene nodes with the highest degree?\n",
    "* Are there any gene-gene connections that might be due to indirect connections? In other words: which 2 genes are connected in 2 steps that are also connected in 1 step? That might mean that the direct connection is actually indirect.\n",
    "* Are there any cliques (= fully-connected subgraphs) of exactly 4 nodes? Return 1."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Solutions\n",
    "* `MATCH (n:Disease) RETURN n LIMIT 3;`\n",
    "* `MATCH (n:Disease) RETURN COUNT(n);`\n",
    "* `MATCH (n:Gene)-[r*2]->(m:Gene) WHERE NOT n = m RETURN COUNT(r);`\n",
    "* `MATCH (n:Gene {name: \"CRISP3\"})-[r]->(m:Disease) RETURN n,r,m;`\n",
    "* `MATCH p=shortestPath((n:Gene {name: 'CRISP3'})-[*..500]-(m:Gene {name: 'ADAM2'})) RETURN p;`\n",
    "* Solution:\n",
    "```\n",
    "MATCH (n:Gene)-[r]-(m:Gene)  \n",
    "  RETURN n.name, COUNT(r) AS DegreeScore  \n",
    "  ORDER BY DegreeScore DESC\n",
    "  LIMIT 10;\n",
    "```\n",
    "* `MATCH (n:Gene)-[r]->(m:Gene)-[s]->(o:Gene), (n:Gene)-[t]->(o:Gene) RETURN n,m,o,r,s,t LIMIT 2;`\n",
    "* `MATCH (a:Gene)--(b:Gene),(a)--(c:Gene),(a)--(d:Gene),(b)--(c),(b)--(d),(c)--(d) RETURN a,b,c,d LIMIT 1;`"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# 2. Using the python API\n",
    "The CYPHER language as used above is very useful for extracting specific patterns from a graph database. However, if we want to investigate bigger structures, it is often necessary to go for a more generic approach. For example, if we want to find out more about the structure in the data.\n",
    "\n",
    "The python API for neo4j we use here is `py2neo`.\n",
    "\n",
    "## 2.1 Connecting to the database\n",
    "\n",
    "To connect to the database from python, we will first need to:\n",
    "* Load the necessary modules\n",
    "* Create a graph_db connection\n",
    "\n",
    "The default user/password for neo4j is `neo4j/neo4j`, but the `jandot/neo4j-i0u19a` docker image is configured so that you don't need a username/password to access the data. This has been done by changing the neo4j configuration file:\n",
    "\n",
    "```\n",
    "sed -i.bak 's/dbms.security.auth_enabled=true/dbms.security.auth_enabled=false/' /var/lib/neo4j/conf/neo4j-server.properties\n",
    "```\n",
    "\n",
    "For a list of commands available for the py2neo API, see [here](http://py2neo.org/2.0/essentials.html).\n",
    "\n",
    "So let's connect."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph, Node, Relationship\n",
    "graph_db = Graph(\"http://192.168.99.100:7474/db/data/\") # Change IP if necessary"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2.2 Simple queries\n",
    "We can still use CYPHER as a language when working in py2neo:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | n.name | m.name  | o.name                  \n",
       "---+--------+---------+--------------------------\n",
       " 1 | IFIT3  | IFNA2   | Abdominal Pain          \n",
       " 2 | APOB   | MTTP    | Abetalipoproteinemia    \n",
       " 3 | ERBB3  | SLC31A1 | Congenital Abnormalities\n",
       " 4 | LGALS8 | SLC31A1 | Congenital Abnormalities\n",
       " 5 | NXF1   | SLC31A1 | Congenital Abnormalities"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph_db.cypher.execute(\"MATCH (n:Gene)-[r]->(m:Gene)-[s]->(o:Disease) RETURN n.name,m.name,o.name LIMIT 5;\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('Gene 1: ', u'IFIT3', '; Gene 2: ', u'Abdominal Pain')\n",
      "('Gene 1: ', u'APOB', '; Gene 2: ', u'Abetalipoproteinemia')\n",
      "('Gene 1: ', u'ERBB3', '; Gene 2: ', u'Congenital Abnormalities')\n",
      "('Gene 1: ', u'LGALS8', '; Gene 2: ', u'Congenital Abnormalities')\n",
      "('Gene 1: ', u'NXF1', '; Gene 2: ', u'Congenital Abnormalities')\n",
      "('Gene 1: ', u'MOV10', '; Gene 2: ', u'Congenital Abnormalities')\n",
      "('Gene 1: ', u'CCS', '; Gene 2: ', u'Congenital Abnormalities')\n",
      "('Gene 1: ', u'SLC31A1', '; Gene 2: ', u'Congenital Abnormalities')\n",
      "('Gene 1: ', u'AURKA', '; Gene 2: ', u'Congenital Abnormalities')\n",
      "('Gene 1: ', u'CDH1', '; Gene 2: ', u'Congenital Abnormalities')\n",
      "('Gene 1: ', u'CTBP1', '; Gene 2: ', u'Congenital Abnormalities')\n",
      "('Gene 1: ', u'APP', '; Gene 2: ', u'Congenital Abnormalities')\n",
      "('Gene 1: ', u'CUL2', '; Gene 2: ', u'Congenital Abnormalities')\n",
      "('Gene 1: ', u'HDAC7', '; Gene 2: ', u'Congenital Abnormalities')\n",
      "('Gene 1: ', u'KAT5', '; Gene 2: ', u'Congenital Abnormalities')\n",
      "('Gene 1: ', u'EP300', '; Gene 2: ', u'Congenital Abnormalities')\n",
      "('Gene 1: ', u'HDAC1', '; Gene 2: ', u'Congenital Abnormalities')\n",
      "('Gene 1: ', u'HDAC2', '; Gene 2: ', u'Congenital Abnormalities')\n",
      "('Gene 1: ', u'HDAC5', '; Gene 2: ', u'Congenital Abnormalities')\n",
      "('Gene 1: ', u'ELK1', '; Gene 2: ', u'Congenital Abnormalities')\n"
     ]
    }
   ],
   "source": [
    "results = graph_db.cypher.execute(\"MATCH (n:Gene)-[r]->(m:Gene)-[s]->(o:Disease) RETURN n.name,m.name,o.name LIMIT 20;\")\n",
    "for result in results:\n",
    "    print(\"Gene 1: \", result[0], \"; Gene 2: \", result[2])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "ABCD1\n"
     ]
    }
   ],
   "source": [
    "abcd1 = graph_db.find_one(\"Gene\", \"name\", \"ABCD1\")\n",
    "print(abcd1.properties['name'])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "What are the 10 disease nodes with the highest degree? Return the link-count and the node name."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(460, u'Prostatic Neoplasms')\n",
      "(434, u'Glomerulonephritis; IGA')\n",
      "(402, u'Breast Neoplasms')\n",
      "(293, u'Peripheral Nervous System Diseases')\n",
      "(272, u'Stomach Neoplasms')\n",
      "(241, u'Autistic Disorder')\n",
      "(228, u'Colorectal Neoplasms')\n",
      "(214, u'Carcinoma; Hepatocellular')\n",
      "(193, u'Melanoma')\n",
      "(176, u'Schizophrenia')\n"
     ]
    }
   ],
   "source": [
    "results = graph_db.cypher.execute(\"MATCH (n:Disease)<-[r]-() RETURN n, count(r) ORDER BY count(r) DESC LIMIT 10;\")\n",
    "for result in results:\n",
    "    print(result[1], result[0].properties['name'])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2.3 Does this look like a random network?\n",
    "Let's see how degree frequencies are distributed, and compare to a random network afterwards.\n",
    "\n",
    "To calculate degree frequencies:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{1: 2252,\n",
       " 2: 1492,\n",
       " 3: 1036,\n",
       " 4: 795,\n",
       " 5: 660,\n",
       " 6: 594,\n",
       " 7: 506,\n",
       " 8: 442,\n",
       " 9: 401,\n",
       " 10: 320,\n",
       " 11: 312,\n",
       " 12: 274,\n",
       " 13: 263,\n",
       " 14: 234,\n",
       " 15: 204,\n",
       " 16: 218,\n",
       " 17: 172,\n",
       " 18: 165,\n",
       " 19: 140,\n",
       " 20: 137,\n",
       " 21: 125,\n",
       " 22: 126,\n",
       " 23: 117,\n",
       " 24: 96,\n",
       " 25: 102,\n",
       " 26: 126,\n",
       " 27: 72,\n",
       " 28: 95,\n",
       " 29: 66,\n",
       " 30: 74,\n",
       " 31: 55,\n",
       " 32: 72,\n",
       " 33: 56,\n",
       " 34: 60,\n",
       " 35: 51,\n",
       " 36: 63,\n",
       " 37: 39,\n",
       " 38: 50,\n",
       " 39: 44,\n",
       " 40: 36,\n",
       " 41: 48,\n",
       " 42: 38,\n",
       " 43: 29,\n",
       " 44: 37,\n",
       " 45: 25,\n",
       " 46: 34,\n",
       " 47: 28,\n",
       " 48: 33,\n",
       " 49: 27,\n",
       " 50: 29,\n",
       " 51: 24,\n",
       " 52: 27,\n",
       " 53: 24,\n",
       " 54: 25,\n",
       " 55: 18,\n",
       " 56: 13,\n",
       " 57: 19,\n",
       " 58: 21,\n",
       " 59: 28,\n",
       " 60: 22,\n",
       " 61: 15,\n",
       " 62: 16,\n",
       " 63: 14,\n",
       " 64: 16,\n",
       " 65: 12,\n",
       " 66: 15,\n",
       " 67: 10,\n",
       " 68: 18,\n",
       " 69: 14,\n",
       " 70: 12,\n",
       " 71: 14,\n",
       " 72: 7,\n",
       " 73: 15,\n",
       " 74: 14,\n",
       " 75: 8,\n",
       " 76: 10,\n",
       " 77: 5,\n",
       " 78: 13,\n",
       " 79: 5,\n",
       " 80: 4,\n",
       " 81: 5,\n",
       " 82: 11,\n",
       " 83: 6,\n",
       " 84: 7,\n",
       " 85: 9,\n",
       " 86: 8,\n",
       " 87: 6,\n",
       " 88: 8,\n",
       " 89: 3,\n",
       " 90: 11,\n",
       " 91: 9,\n",
       " 92: 1,\n",
       " 93: 4,\n",
       " 94: 6,\n",
       " 95: 6,\n",
       " 96: 4,\n",
       " 97: 1,\n",
       " 98: 3,\n",
       " 99: 3,\n",
       " 100: 4,\n",
       " 101: 5,\n",
       " 102: 2,\n",
       " 103: 9,\n",
       " 104: 3,\n",
       " 105: 5,\n",
       " 106: 2,\n",
       " 107: 4,\n",
       " 108: 6,\n",
       " 109: 3,\n",
       " 110: 8,\n",
       " 111: 1,\n",
       " 112: 2,\n",
       " 113: 5,\n",
       " 114: 6,\n",
       " 115: 4,\n",
       " 116: 1,\n",
       " 117: 4,\n",
       " 118: 1,\n",
       " 119: 3,\n",
       " 120: 4,\n",
       " 121: 6,\n",
       " 122: 4,\n",
       " 123: 2,\n",
       " 124: 3,\n",
       " 125: 5,\n",
       " 126: 3,\n",
       " 128: 2,\n",
       " 129: 1,\n",
       " 131: 4,\n",
       " 132: 3,\n",
       " 133: 1,\n",
       " 134: 1,\n",
       " 135: 4,\n",
       " 136: 1,\n",
       " 137: 1,\n",
       " 138: 1,\n",
       " 139: 1,\n",
       " 140: 4,\n",
       " 141: 4,\n",
       " 142: 1,\n",
       " 143: 2,\n",
       " 144: 2,\n",
       " 145: 2,\n",
       " 146: 2,\n",
       " 147: 1,\n",
       " 148: 2,\n",
       " 150: 1,\n",
       " 151: 2,\n",
       " 152: 3,\n",
       " 153: 1,\n",
       " 157: 3,\n",
       " 158: 1,\n",
       " 159: 1,\n",
       " 160: 1,\n",
       " 161: 1,\n",
       " 162: 2,\n",
       " 163: 2,\n",
       " 167: 2,\n",
       " 168: 1,\n",
       " 170: 1,\n",
       " 172: 3,\n",
       " 175: 2,\n",
       " 177: 1,\n",
       " 180: 1,\n",
       " 181: 3,\n",
       " 182: 1,\n",
       " 183: 1,\n",
       " 185: 3,\n",
       " 186: 2,\n",
       " 187: 1,\n",
       " 189: 1,\n",
       " 193: 1,\n",
       " 194: 1,\n",
       " 196: 1,\n",
       " 203: 2,\n",
       " 204: 1,\n",
       " 205: 1,\n",
       " 206: 2,\n",
       " 210: 1,\n",
       " 211: 2,\n",
       " 212: 1,\n",
       " 214: 2,\n",
       " 216: 1,\n",
       " 221: 2,\n",
       " 222: 1,\n",
       " 223: 1,\n",
       " 226: 1,\n",
       " 228: 1,\n",
       " 230: 1,\n",
       " 234: 2,\n",
       " 235: 1,\n",
       " 238: 2,\n",
       " 239: 1,\n",
       " 241: 1,\n",
       " 243: 1,\n",
       " 252: 1,\n",
       " 253: 3,\n",
       " 261: 1,\n",
       " 263: 2,\n",
       " 269: 1,\n",
       " 273: 1,\n",
       " 277: 1,\n",
       " 278: 1,\n",
       " 284: 1,\n",
       " 289: 1,\n",
       " 299: 2,\n",
       " 308: 1,\n",
       " 309: 1,\n",
       " 312: 1,\n",
       " 323: 1,\n",
       " 332: 1,\n",
       " 335: 1,\n",
       " 343: 1,\n",
       " 346: 1,\n",
       " 357: 1,\n",
       " 359: 1,\n",
       " 382: 1,\n",
       " 383: 1,\n",
       " 412: 1,\n",
       " 424: 1,\n",
       " 435: 1,\n",
       " 474: 1,\n",
       " 476: 1,\n",
       " 478: 1,\n",
       " 486: 1,\n",
       " 487: 1,\n",
       " 525: 1,\n",
       " 526: 1,\n",
       " 537: 1,\n",
       " 546: 1,\n",
       " 550: 1,\n",
       " 565: 1,\n",
       " 588: 1,\n",
       " 641: 1,\n",
       " 694: 1,\n",
       " 858: 1,\n",
       " 1006: 1,\n",
       " 1333: 1,\n",
       " 1951: 1}"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = graph_db.cypher.execute(\"MATCH (n:Gene)-[r]->(m:Gene) RETURN n, count(r);\")\n",
    "counts = {}\n",
    "for result in results:\n",
    "    if result[1] in counts:\n",
    "        counts[result[1]] += 1\n",
    "    else:\n",
    "        counts[result[1]] = 1\n",
    "counts"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Let's plot these using bokeh:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "ename": "ImportError",
     "evalue": "No module named bokeh.plotting",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mImportError\u001b[0m                               Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-7-1e759564834d>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[0;32m----> 1\u001b[0;31m \u001b[0;32mfrom\u001b[0m \u001b[0mbokeh\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mplotting\u001b[0m \u001b[0;32mimport\u001b[0m \u001b[0mfigure\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mshow\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m      2\u001b[0m \u001b[0;32mfrom\u001b[0m \u001b[0mbokeh\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcharts\u001b[0m \u001b[0;32mimport\u001b[0m \u001b[0mBar\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      3\u001b[0m \u001b[0;32mfrom\u001b[0m \u001b[0mbokeh\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mio\u001b[0m \u001b[0;32mimport\u001b[0m \u001b[0moutput_notebook\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      4\u001b[0m \u001b[0moutput_notebook\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mImportError\u001b[0m: No module named bokeh.plotting"
     ]
    }
   ],
   "source": [
    "from bokeh.plotting import figure, show\n",
    "from bokeh.charts import Bar\n",
    "from bokeh.io import output_notebook\n",
    "output_notebook()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'figure' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-8-9f5db24f743e>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[1;32m      1\u001b[0m \u001b[0ma\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mlist\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcounts\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mkeys\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      2\u001b[0m \u001b[0mb\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mlist\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcounts\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mvalues\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 3\u001b[0;31m \u001b[0mp\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mfigure\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mtitle\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;34m\"simple line example\"\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mx_axis_label\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;34m'x'\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0my_axis_label\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;34m'y'\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m      4\u001b[0m \u001b[0mp\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mline\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0ma\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mb\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mlegend\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;34m\"Temp.\"\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mline_width\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;36m2\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      5\u001b[0m \u001b[0mshow\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mp\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mNameError\u001b[0m: name 'figure' is not defined"
     ]
    }
   ],
   "source": [
    "a = list(counts.keys())\n",
    "b = list(counts.values())\n",
    "p = figure(title=\"simple line example\", x_axis_label='x', y_axis_label='y')\n",
    "p.line(a, b, legend=\"Temp.\", line_width=2)\n",
    "show(p)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Let's generate a new graph with the same fraction of nodes to relationships, connected at random. Ideally, we'd use the same number as in the real dataset, but that will take too long to generate... We'll take 1/10 of the size.\n",
    "\n",
    "Steps:\n",
    "1. find out the number of gene nodes and the number of relationships\n",
    "2. create new nodes and generate random relationships between them\n",
    "3. recreate the same plot as above"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 1. Get the number of gene nodes, and the number of relationships."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "61237\n",
      "213340\n"
     ]
    }
   ],
   "source": [
    "nr_nodes = graph_db.cypher.execute(\"MATCH (n:Gene) RETURN COUNT(n);\")\n",
    "print(nr_nodes[0][0])\n",
    "nr_relationships = graph_db.cypher.execute(\"MATCH (n:Gene)-[r]->(m:Gene) RETURN COUNT(r);\")\n",
    "print(nr_relationships[0][0])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 2. Create new nodes and random relationships\n",
    "Tips:\n",
    "* Give the nodes the label \"RandomNode\" so that you can easily filter them.\n",
    "* Creating these nodes and relationships might take a while. To know how far in the process you are, open a neo4j browser (i.e. http://192.168.99.100:7474), and execute either `MATCH (n:RandomNode) RETURN COUNT(n);` or `MATCH (n:RandomNode)-[r]->(m) RETURN COUNT(r);`.\n",
    "* Start with a **small** network first, to see if everything works as it should. For example, 1/100th of the real network. You can easily remove any tryouts with `MATCH (n:RandomNode) DETACH DELETE n;`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "n = graph_db.cypher.execute(\"MATCH (n:RandomNode) RETURN n LIMIT 1;\")\n",
    "if not n:\n",
    "    scaling = 10\n",
    "    nr_random_nodes = int(nr_nodes[0][0]/scaling)\n",
    "    for i in range(1,nr_random_nodes):\n",
    "        graph_db.create(Node(\"RandomNode\", number=i))\n",
    "\n",
    "    from random import randint\n",
    "    for i in range(1,int(nr_relationships[0][0]/scaling)-1):\n",
    "        n1 = randint(1,nr_random_nodes-1)\n",
    "        n2 = randint(1,nr_random_nodes-1)\n",
    "        node1 = graph_db.find_one(\"RandomNode\",\"number\",n1)\n",
    "        node2 = graph_db.find_one(\"RandomNode\",\"number\",n2)\n",
    "        graph_db.create(Relationship(node1, \"LINKED_TO\", node2))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 3. Now calculate everything and plot for these random data => are they the same?\n",
    "Calculate the same counts as above, and create the same plot. You do not have to load the bokeh library anymore, because we already did that."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{1: 635,\n",
       " 2: 1144,\n",
       " 3: 1327,\n",
       " 4: 1187,\n",
       " 5: 774,\n",
       " 6: 463,\n",
       " 7: 214,\n",
       " 8: 114,\n",
       " 9: 46,\n",
       " 10: 14,\n",
       " 11: 4,\n",
       " 12: 2}"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "random_results = graph_db.cypher.execute(\"MATCH (n:RandomNode)-[r]->(m:RandomNode) RETURN n, count(r);\")\n",
    "random_counts = {}\n",
    "for result in random_results:\n",
    "    if result[1] in random_counts:\n",
    "        random_counts[result[1]] += 1\n",
    "    else:\n",
    "        random_counts[result[1]] = 1\n",
    "random_counts"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'figure' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-12-7cb51c4b29de>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[1;32m      1\u001b[0m \u001b[0ma\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mlist\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mrandom_counts\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mkeys\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      2\u001b[0m \u001b[0mb\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mlist\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mrandom_counts\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mvalues\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 3\u001b[0;31m \u001b[0mp\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mfigure\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mtitle\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;34m\"simple line example\"\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mx_axis_label\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;34m'x'\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0my_axis_label\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;34m'y'\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m      4\u001b[0m \u001b[0mp\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mline\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0ma\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mb\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mlegend\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;34m\"Temp.\"\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mline_width\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;36m2\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      5\u001b[0m \u001b[0mshow\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mp\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mNameError\u001b[0m: name 'figure' is not defined"
     ]
    }
   ],
   "source": [
    "a = list(random_counts.keys())\n",
    "b = list(random_counts.values())\n",
    "p = figure(title=\"simple line example\", x_axis_label='x', y_axis_label='y')\n",
    "p.line(a, b, legend=\"Temp.\", line_width=2)\n",
    "show(p)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "## 2.4 Centralities\n",
    "For many purposes, it is important to know how \"central\" a node is in a network. Of course, different definitions exist for centrality...\n",
    "\n",
    "### A. Degree centrality\n",
    "Same as node degree: how many relationships does each node have?\n",
    "\n",
    "What are the 5 nodes with the highest degree centrality?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | n                                             | COUNT(r)\n",
       "---+-----------------------------------------------+----------\n",
       " 1 | (n1436:Gene {geneId:\"APP\",name:\"APP\"})        |     2058\n",
       " 2 | (n29813:Gene {geneId:\"NTRK1\",name:\"NTRK1\"})   |     1942\n",
       " 3 | (n17517:Gene {geneId:\"ELAVL1\",name:\"ELAVL1\"}) |     1762\n",
       " 4 | (n46572:Gene {geneId:\"XPO1\",name:\"XPO1\"})     |     1207\n",
       " 5 | (n14708:Gene {geneId:\"CUL3\",name:\"CUL3\"})     |     1189"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "connected_nodes = graph_db.cypher.execute(\"MATCH (n:Gene)-[r]-(m:Gene) RETURN n, COUNT(r) ORDER BY COUNT(r) DESC LIMIT 5;\")\n",
    "connected_nodes"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "So it seems that the gene APP has the highest number of relationships: 2,058. But wait a second... When we looked at the degree frequencies before, we found that the maximum frequency was 1,951. Why is this?\n",
    "\n",
    "Answer: previously, we looked at out-degree instead of in+out-degree. => should recalculate"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### B. Betweenness centrality\n",
    "How many critical paths go through this node? Calculate all shortest paths between all nodes, and check how many of these go through your node of interest. Unfortunately, this is a very compute intensive operation, so we'll create a small network of 15 nodes and 17 edges that looks like this:\n",
    "![small network](images/small_network.png)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "n = graph_db.cypher.execute(\"MATCH (n:NewNode) RETURN n LIMIT 1;\")\n",
    "links = [[0,1],[1,2],[1,3],[2,3],[2,4],[3,4],[4,5],[4,6],[6,7],[6,8],[8,9],[8,10],[8,11],[10,11],[4,12],[12,13],[12,14]]\n",
    "if not n:\n",
    "    newNodes = {}\n",
    "    for i in range(0,15):\n",
    "        newNodes[i] = Node(\"NewNode\", number=i)\n",
    "        graph_db.create(newNodes[i])\n",
    "    for link in links:\n",
    "        graph_db.create(Relationship(newNodes[link[0]], \"CONNECTS_TO\", newNodes[link[1]]))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Given this smaller dataset, let's calculate the betweenness centrality for each node.\n",
    "\n",
    "Tip: to calculate the shortest path between 2 nodes, use something like:\n",
    "```\n",
    "MATCH p = shortestPath((a:NewNode {number: 0})-[*..500]-(b:NewNode {number: 14})) RETURN p\n",
    "```"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "If we're going to run `shortestPath` queries, we need to find out what the output looks like exactly. So let's just calculate one, and dig in."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "#### Result as a whole:\n",
      "   | p                                                                                                                                                                             \n",
      "---+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n",
      " 1 | (:NewNode {number:3})-[:CONNECTS_TO]->(:NewNode {number:4})-[:CONNECTS_TO]->(:NewNode {number:6})-[:CONNECTS_TO]->(:NewNode {number:8})-[:CONNECTS_TO]->(:NewNode {number:11})\n",
      "\n",
      "#### Getting the actual result without ID column:\n",
      " p                                                                                                                                                                             \n",
      "--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n",
      " (:NewNode {number:3})-[:CONNECTS_TO]->(:NewNode {number:4})-[:CONNECTS_TO]->(:NewNode {number:6})-[:CONNECTS_TO]->(:NewNode {number:8})-[:CONNECTS_TO]->(:NewNode {number:11})\n",
      "\n",
      "#### Getting the path p:\n",
      "(:NewNode {number:3})-[:CONNECTS_TO]->(:NewNode {number:4})-[:CONNECTS_TO]->(:NewNode {number:6})-[:CONNECTS_TO]->(:NewNode {number:8})-[:CONNECTS_TO]->(:NewNode {number:11})\n",
      "#### What methods does this path object have?\n",
      "['_Path__metadata', '_Path__nodes', '_Path__order', '_Path__relationships', '_Path__rels', '_Path__size', '__add__', '__bool__', '__class__', '__delattr__', '__dict__', '__doc__', '__eq__', '__format__', '__getattribute__', '__getitem__', '__hash__', '__init__', '__iter__', '__len__', '__module__', '__ne__', '__new__', '__nonzero__', '__radd__', '__reduce__', '__reduce_ex__', '__repr__', '__reversed__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', '__unicode__', '__weakref__', 'append', 'bound', 'create', 'end_node', 'exists', 'get_or_create', 'graph', 'hydrate', 'nodes', 'order', 'prepend', 'pull', 'push', 'relationships', 'rels', 'service_root', 'size', 'start_node', 'unbind']\n",
      "#### Getting the length of the path:\n",
      "4\n",
      "#### Getting a list of the nodes:\n",
      "(<Node graph=u'http://192.168.99.100:7474/db/data/' ref=u'node/74123' labels=set([u'NewNode']) properties={u'number': 3}>, <Node graph=u'http://192.168.99.100:7474/db/data/' ref=u'node/74124' labels=set([u'NewNode']) properties={u'number': 4}>, <Node graph=u'http://192.168.99.100:7474/db/data/' ref=u'node/74126' labels=set([u'NewNode']) properties={u'number': 6}>, <Node graph=u'http://192.168.99.100:7474/db/data/' ref=u'node/74128' labels=set([u'NewNode']) properties={u'number': 8}>, <Node graph=u'http://192.168.99.100:7474/db/data/' ref=u'node/74131' labels=set([u'NewNode']) properties={u'number': 11}>)\n",
      "#### Getting the node IDs:\n",
      "[3, 4, 6, 8, 11]\n"
     ]
    }
   ],
   "source": [
    "query = \"MATCH p = shortestPath((a:NewNode {number: 3})-[*..500]-(b:NewNode {number: 11})) RETURN p\"\n",
    "result = graph_db.cypher.execute(query)\n",
    "print(\"#### Result as a whole:\")\n",
    "print(result)\n",
    "print(\"#### Getting the actual result without ID column:\")\n",
    "print(result[0])\n",
    "print(\"#### Getting the path p:\")\n",
    "print(result[0].p)\n",
    "print(\"#### What methods does this path object have?\")\n",
    "print(dir(result[0].p))\n",
    "print(\"#### Getting the length of the path:\")\n",
    "print(result[0].p.size)\n",
    "print(\"#### Getting a list of the nodes:\")\n",
    "print(result[0].p.nodes)\n",
    "print(\"#### Getting the node IDs:\")\n",
    "print(list(map(lambda x: x.properties['number'], result[0].p.nodes)))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now let's count the actual number of times that each node is in the shortest path between any other two nodes."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{0: 14,\n",
       " 1: 27,\n",
       " 2: 14,\n",
       " 3: 36,\n",
       " 4: 81,\n",
       " 5: 14,\n",
       " 6: 63,\n",
       " 7: 14,\n",
       " 8: 49,\n",
       " 9: 14,\n",
       " 10: 14,\n",
       " 11: 14,\n",
       " 12: 39,\n",
       " 13: 14,\n",
       " 14: 14}"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "template_query = \"MATCH p = shortestPath((a:NewNode {number: X})-[*..500]-(b:NewNode {number: Y})) RETURN p\"\n",
    "node_counts = {}\n",
    "\n",
    "## Initialize the counts to 0\n",
    "for i in range(0,15):\n",
    "    node_counts[i] = 0\n",
    "\n",
    "## Fetch all shortest paths and count the number of times each node is mentioned\n",
    "for i in range(0,15):\n",
    "    for j in range(0,15):\n",
    "        if i < j: # We don't want to fetch each shortest path twice (i.e. in both directions)\n",
    "            query = template_query.replace('X',str(i)).replace('Y',str(j))\n",
    "            r = graph_db.cypher.execute(query)            \n",
    "            result = r[0].p\n",
    "            for n in result.nodes:\n",
    "                node_counts[n.properties['number']] += 1\n",
    "\n",
    "node_counts"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### C. Closeness centrality\n",
    "Is a bit less stringent than betweenness centrality: how much is a node in the \"middle\" of the network, not too far from the center? Calculate this by checking the average shortest path between this node and all other nodes."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{0: 58,\n",
       " 1: 45,\n",
       " 2: 35,\n",
       " 3: 35,\n",
       " 4: 27,\n",
       " 5: 40,\n",
       " 6: 30,\n",
       " 7: 43,\n",
       " 8: 37,\n",
       " 9: 50,\n",
       " 10: 49,\n",
       " 11: 49,\n",
       " 12: 36,\n",
       " 13: 49,\n",
       " 14: 49}"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "template_query = \"MATCH p = shortestPath((a:NewNode {number: X})-[*..500]-(b:NewNode {number: Y})) RETURN p\"\n",
    "path_lengths = {}\n",
    "for i in range(0,15):\n",
    "    path_lengths[i] = 0\n",
    "\n",
    "for i in range(0,15):\n",
    "    for j in range(0,15):\n",
    "        if i < j:\n",
    "            query = template_query.replace('X',str(i)).replace('Y',str(j))\n",
    "            r = graph_db.cypher.execute(query)            \n",
    "            result = r[0].p\n",
    "            path_lengths[i] += r[0].p.size\n",
    "            path_lengths[j] += r[0].p.size\n",
    "\n",
    "path_lengths"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 2.4 Cliques\n",
    "Above, we identified cliques with 4 nodes. It'd be more useful to search for those containing 7 or more, as suggested in the paper by Pradhan et al [Cliques for the identification of gene signatures for colorectal cancer across population](http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3524317/). Unfortunately, this will give us a `java heapspace` error with the current setup of the server.\n",
    "\n",
    "So can we do this using the python API instead? One possible option might work like this:\n",
    "* Find all nodes that have a degree of 7.\n",
    "* For each of these, fetch the related nodes, and store these in a dictionary:\n",
    "```\n",
    "{key: node_a, linked_nodes: [node_b, node_c, node_d, ...]}\n",
    "{key: node_b: linked_nodes: [node_a, node_c, node_d, ...]}\n",
    "...\n",
    "```\n",
    "* If we then take those arrays of linked nodes, add the key, and sort these, we will get something like this:\n",
    "```\n",
    "[node_a, node_b, node_c, node_d, ...] # based on neighbours of node_a\n",
    "[node_a, node_b, node_c, node_d, ...] # based on neighbours of node_b\n",
    "...\n",
    "```\n",
    "* If a certain combination appears 7 times, we have a clique of 7.\n",
    "\n",
    "Of course, this is for nodes with **exactly** 7 relations. So for us find a clique of 7 like that, that clique would have to be unconnected from the rest of the graph. To correct for that, we actually need to search for those with *7 or more* relations, and instead of just checking for identity between the resulting arrays we have to check for subarrays."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "ABTB1 -- EEF1D\n",
      "ABTB1 -- EEF1A2\n",
      "ABTB1 -- SMAD2\n",
      "ABTB1 -- SMAD9\n",
      "ABTB1 -- CUL3\n",
      "ABTB1 -- DNTTIP1\n",
      "ABTB2 -- XPO1\n",
      "ABTB2 -- COPS5\n",
      "ABTB2 -- DNTT\n",
      "ABTB2 -- RBX1\n",
      "ABTB2 -- CUL3\n",
      "ABTB2 -- EEF1A1\n",
      "ACAP1 -- RABGAP1L\n",
      "ACAP1 -- GRB2\n",
      "ACAP1 -- RAB11FIP3\n",
      "ACAP1 -- AKT1\n",
      "ACAP1 -- ITGB1\n",
      "ACAP1 -- IFFO1\n",
      "ACKR2 -- APP\n",
      "ACKR2 -- CCL14\n",
      "ACKR2 -- CCL13\n",
      "ACKR2 -- CCL7\n",
      "ACKR2 -- CCL5\n",
      "ACKR2 -- CCL8\n",
      "ACPP -- RPS6KB2\n",
      "ACPP -- DDX19B\n",
      "ACPP -- MMRN1\n",
      "ACPP -- SHBG\n",
      "ACPP -- UBC\n",
      "ACPP -- ACPP\n",
      "ADAMTSL3 -- NOTCH2NL\n",
      "ADAMTSL3 -- KRTAP10-3\n",
      "ADAMTSL3 -- KRTAP10-8\n",
      "ADAMTSL3 -- KRT40\n",
      "ADAMTSL3 -- KRTAP2-4\n",
      "ADAMTSL3 -- MDFI\n",
      "AGAP3 -- HERC2\n",
      "AGAP3 -- NTRK1\n",
      "AGAP3 -- HSPB1\n",
      "AGAP3 -- MIER2\n",
      "AGAP3 -- FKBP6\n",
      "AGAP3 -- YWHAB\n",
      "AHSP -- UBE3A\n",
      "AHSP -- FKBP1A\n",
      "AHSP -- TMEM165\n",
      "AHSP -- RAD21\n",
      "AHSP -- POLR2M\n",
      "AHSP -- ZC3H12A\n",
      "ALDH3B2 -- SLC18A1\n",
      "ALDH3B2 -- ZMYM2\n",
      "ALDH3B2 -- COX16\n",
      "ALDH3B2 -- ALDH3B1\n",
      "ALDH3B2 -- OBSL1\n",
      "ALDH3B2 -- CLGN\n",
      "ALG5 -- EDA\n",
      "ALG5 -- POMK\n",
      "ALG5 -- CACNG4\n",
      "ALG5 -- PKD2\n",
      "ALG5 -- CD1B\n",
      "ALG5 -- SPINT2\n",
      "ANXA13 -- CCDC67\n",
      "ANXA13 -- TUBGCP3\n",
      "ANXA13 -- ANXA2\n",
      "ANXA13 -- MSI2\n",
      "ANXA13 -- APBB1IP\n",
      "ANXA13 -- NEDD4\n",
      "ANXA8L1 -- RDH12\n",
      "ANXA8L1 -- ACD\n",
      "ANXA8L1 -- TINF2\n",
      "ANXA8L1 -- TERF2IP\n",
      "ANXA8L1 -- TERF1\n",
      "ANXA8L1 -- UCHL5\n",
      "ARHGAP12 -- XPO1\n",
      "ARHGAP12 -- TRIP10\n",
      "ARHGAP12 -- SRPK1\n",
      "ARHGAP12 -- SRPK2\n",
      "ARHGAP12 -- MAPK11\n",
      "ARHGAP12 -- GRB2\n",
      "ARHGAP15 -- APP\n",
      "ARHGAP15 -- KDM1A\n",
      "ARHGAP15 -- CD93\n",
      "ARHGAP15 -- PRNP\n",
      "ARHGAP15 -- SNCA\n",
      "ARHGAP15 -- RAC1\n",
      "ARHGEF18 -- CNTRL\n",
      "ARHGEF18 -- LTBR\n",
      "ARHGEF18 -- TERF1\n",
      "ARHGEF18 -- TAF10\n",
      "ARHGEF18 -- RHOA\n",
      "ARHGEF18 -- GNB1\n",
      "ARHGEF40 -- NTRK1\n",
      "ARHGEF40 -- SPERT\n",
      "ARHGEF40 -- LGR4\n",
      "ARHGEF40 -- APP\n",
      "ARHGEF40 -- STC2\n",
      "ARHGEF40 -- MYCBP\n",
      "ARL4A -- KRAS\n",
      "ARL4A -- CCDC57\n",
      "ARL4A -- SPATC1L\n",
      "ARL4A -- CCDC102B\n",
      "ARL4A -- GOLGA2\n",
      "ARL4A -- KPNA2\n",
      "ARL5A -- APP\n",
      "ARL5A -- ELAVL1\n",
      "ARL5A -- KPNA2\n",
      "ARL5A -- CBX3\n",
      "ARL5A -- CBX5\n",
      "ARL5A -- CBX1\n",
      "ATRN -- PTPRK\n",
      "ATRN -- BTNL8\n",
      "ATRN -- ZNF408\n",
      "ATRN -- XRN2\n",
      "ATRN -- FBXO6\n",
      "ATRN -- COPS5\n",
      "BCL2L10 -- CASP8\n",
      "BCL2L10 -- NR4A1\n",
      "BCL2L10 -- UBQLN1\n",
      "BCL2L10 -- BAX\n",
      "BCL2L10 -- BCL2\n",
      "BCL2L10 -- BCL2L10\n",
      "BLOC1S4 -- XPO1\n",
      "BLOC1S4 -- DTNBP1\n",
      "BLOC1S4 -- AIMP2\n",
      "BLOC1S4 -- BLOC1S2\n",
      "BLOC1S4 -- SNAPIN\n",
      "BLOC1S4 -- BLOC1S6\n",
      "BPHL -- MTHFD1L\n",
      "BPHL -- TTC19\n",
      "BPHL -- PPP5C\n",
      "BPHL -- SETD3\n",
      "BPHL -- MUT\n",
      "BPHL -- SHMT2\n",
      "BPNT1 -- MEMO1\n",
      "BPNT1 -- GDPGP1\n",
      "BPNT1 -- FAHD1\n",
      "BPNT1 -- TANGO2\n",
      "BPNT1 -- ACY1\n",
      "BPNT1 -- IQCB1\n",
      "BROX -- SORD\n",
      "BROX -- PDCD6IP\n",
      "BROX -- LDHA\n",
      "BROX -- HRSP12\n",
      "BROX -- FN1\n",
      "BROX -- CHMP4B\n",
      "C16orf87 -- HIST1H2BA\n",
      "C16orf87 -- MOV10\n",
      "C16orf87 -- MAGEA12\n",
      "C16orf87 -- HDAC2\n",
      "C16orf87 -- HDAC1\n",
      "C16orf87 -- ELAVL1\n",
      "C17orf53 -- LRRK2\n",
      "C17orf53 -- TRIM33\n",
      "C17orf53 -- XPO1\n",
      "C17orf53 -- PIK3R3\n",
      "C17orf53 -- PRMT1\n",
      "C17orf53 -- HECW2\n",
      "C17orf62 -- CREB3L1\n",
      "C17orf62 -- CREB3\n",
      "C17orf62 -- GTF2A1\n",
      "C17orf62 -- P2RX4\n",
      "C17orf62 -- CCDC155\n",
      "C17orf62 -- ETS1\n",
      "C19orf70 -- RAB5A\n",
      "C19orf70 -- HIF1A\n",
      "C19orf70 -- CLN3\n",
      "C19orf70 -- SLC25A3\n",
      "C19orf70 -- LAMTOR3\n",
      "C19orf70 -- MRPL24\n",
      "C1QTNF1 -- LNX1\n",
      "C1QTNF1 -- PRPF31\n",
      "C1QTNF1 -- UBQLN4\n",
      "C1QTNF1 -- CACNA1A\n",
      "C1QTNF1 -- AVPR2\n",
      "C1QTNF1 -- SGTA\n",
      "C1orf220 -- ATG4A\n",
      "C1orf220 -- NNT\n",
      "C1orf220 -- OXLD1\n",
      "C1orf220 -- NUDT15\n",
      "C1orf220 -- HCCS\n",
      "C1orf220 -- PDPR\n",
      "C20orf27 -- PPP1R3A\n",
      "C20orf27 -- PPP1CA\n",
      "C20orf27 -- PPP1CC\n",
      "C20orf27 -- TERF2\n",
      "C20orf27 -- RALYL\n",
      "C20orf27 -- PHKB\n",
      "C2orf47 -- MCM2\n",
      "C2orf47 -- TIMMDC1\n",
      "C2orf47 -- ABCE1\n",
      "C2orf47 -- HDAC11\n",
      "C2orf47 -- LYN\n",
      "C2orf47 -- APP\n",
      "C2orf69 -- KLC3\n",
      "C2orf69 -- TACC3\n",
      "C2orf69 -- VPS26A\n",
      "C2orf69 -- SORT1\n",
      "C2orf69 -- KIF11\n",
      "C2orf69 -- HDAC1\n",
      "C3orf33 -- KLHDC3\n",
      "C3orf33 -- SLC39A4\n",
      "C3orf33 -- PEX19\n",
      "C3orf33 -- BSG\n",
      "C3orf33 -- APP\n",
      "C3orf33 -- ELAVL1\n",
      "C4orf19 -- STK24\n",
      "C4orf19 -- STK26\n",
      "C4orf19 -- STK25\n",
      "C4orf19 -- EEF1A2\n",
      "C4orf19 -- PDCD10\n",
      "C4orf19 -- EIF3E\n",
      "C4orf3 -- CALM1\n",
      "C4orf3 -- ERMP1\n",
      "C4orf3 -- DEGS1\n",
      "C4orf3 -- EDC4\n",
      "C4orf3 -- PANX1\n",
      "C4orf3 -- GCN1L1\n",
      "C4orf46 -- KXD1\n",
      "C4orf46 -- TFPT\n",
      "C4orf46 -- CDR2\n",
      "C4orf46 -- SRPK2\n",
      "C4orf46 -- APP\n",
      "C4orf46 -- ELAVL1\n",
      "C5orf24 -- FOXC2\n",
      "C5orf24 -- FOXC1\n",
      "C5orf24 -- CREB1\n",
      "C5orf24 -- MMGT1\n",
      "C5orf24 -- PCDHB15\n",
      "C5orf24 -- EFEMP2\n",
      "C5orf60 -- NOTCH2NL\n",
      "C5orf60 -- KRTAP10-9\n",
      "C5orf60 -- KRT40\n",
      "C5orf60 -- KRTAP3-2\n",
      "C5orf60 -- GMCL1\n",
      "C5orf60 -- KRT31\n",
      "C6orf106 -- XPO1\n",
      "C6orf106 -- MAP3K1\n",
      "C6orf106 -- RPSA\n",
      "C6orf106 -- FBXO25\n",
      "C6orf106 -- APP\n",
      "C6orf106 -- ELAVL1\n",
      "CABLES2 -- DLK1\n",
      "CABLES2 -- FIBP\n",
      "CABLES2 -- ABL1\n",
      "CABLES2 -- CDK5\n",
      "CABLES2 -- CDK3\n",
      "CABLES2 -- TP53\n",
      "CAMTA2 -- PSME3\n",
      "CAMTA2 -- FAM192A\n",
      "CAMTA2 -- CALM3\n",
      "CAMTA2 -- CALM2\n",
      "CAMTA2 -- HDAC5\n",
      "CAMTA2 -- NKX2-5\n",
      "CAPN11 -- SKIV2L2\n",
      "CAPN11 -- PRODH\n",
      "CAPN11 -- UNG\n",
      "CAPN11 -- PRKAR1A\n",
      "CAPN11 -- XRCC6\n",
      "CAPN11 -- ANAPC11\n",
      "CAPRIN2 -- FAM8A1\n",
      "CAPRIN2 -- AUP1\n",
      "CAPRIN2 -- PEX5\n",
      "CAPRIN2 -- LRP6\n",
      "CAPRIN2 -- LRP5\n",
      "CAPRIN2 -- COPS6\n",
      "CARS2 -- CAPN1\n",
      "CARS2 -- PTEN\n",
      "CARS2 -- BLM\n",
      "CARS2 -- OXLD1\n",
      "CARS2 -- RGCC\n",
      "CARS2 -- EGFR\n",
      "CCDC113 -- LTBR\n",
      "CCDC113 -- SMYD1\n",
      "CCDC113 -- PFN2\n",
      "CCDC113 -- IMMT\n",
      "CCDC113 -- HAP1\n",
      "CCDC113 -- GIT1\n",
      "CCDC153 -- DTNBP1\n",
      "CCDC153 -- NECAB2\n",
      "CCDC153 -- GORASP2\n",
      "CCDC153 -- NUP62\n",
      "CCDC153 -- DDIT3\n",
      "CCDC153 -- CDR2\n",
      "CCNI2 -- CDK5\n",
      "CCNI2 -- LARP1B\n",
      "CCNI2 -- HSPA1L\n",
      "CCNI2 -- HSPA6\n",
      "CCNI2 -- HSPA8\n",
      "CCNI2 -- HSPA1B\n",
      "CD72 -- CD5\n",
      "CD72 -- BLNK\n",
      "CD72 -- SYK\n",
      "CD72 -- LYN\n",
      "CD72 -- PTPN6\n",
      "CD72 -- SEMA4D\n",
      "CDK5RAP1 -- C9orf41\n",
      "CDK5RAP1 -- KCTD17\n",
      "CDK5RAP1 -- EXOSC5\n",
      "CDK5RAP1 -- EXOSC3\n",
      "CDK5RAP1 -- BAG3\n",
      "CDK5RAP1 -- CDK5R1\n",
      "CDKL2 -- CDC37\n",
      "CDKL2 -- HSP90AA4P\n",
      "CDKL2 -- HSP90AA5P\n",
      "CDKL2 -- HSP90AA1\n",
      "CDKL2 -- FRY\n",
      "CDKL2 -- APP\n",
      "CDX4 -- PRKAA1\n",
      "CDX4 -- LMO2\n",
      "CDX4 -- LMO1\n",
      "CDX4 -- CKS1B\n",
      "CDX4 -- PRKAB2\n",
      "CDX4 -- PITX1\n",
      "CFAP20 -- FOXJ1\n",
      "CFAP20 -- XPO1\n",
      "CFAP20 -- BMI1\n",
      "CFAP20 -- TFCP2L1\n",
      "CFAP20 -- SF3A2\n",
      "CFAP20 -- YWHAG\n",
      "CHID1 -- TCTN1\n",
      "CHID1 -- MAN2B1\n",
      "CHID1 -- GAA\n",
      "CHID1 -- PAFAH1B1\n",
      "CHID1 -- TMEM25\n",
      "CHID1 -- APP\n",
      "CLEC4M -- GRN\n",
      "CLEC4M -- TLR2\n",
      "CLEC4M -- MME\n",
      "CLEC4M -- CD209\n",
      "CLEC4M -- CLEC4M\n",
      "CLEC4M -- AP2M1\n",
      "CLIP2 -- KLC4\n",
      "CLIP2 -- MAPRE1\n",
      "CLIP2 -- ITSN1\n",
      "CLIP2 -- MAX\n",
      "CLIP2 -- CLASP2\n",
      "CLIP2 -- CLASP1\n",
      "CMTM3 -- MOB3C\n",
      "CMTM3 -- MOB1A\n",
      "CMTM3 -- APP\n",
      "CMTM3 -- SPP1\n",
      "CMTM3 -- MEST\n",
      "CMTM3 -- RABAC1\n",
      "CNTLN -- PRSS12\n",
      "CNTLN -- C9orf41\n",
      "CNTLN -- TPM1\n",
      "CNTLN -- HDAC6\n",
      "CNTLN -- BRCA1\n",
      "CNTLN -- SP1\n",
      "CNTNAP4 -- RANBP10\n",
      "CNTNAP4 -- MACF1\n",
      "CNTNAP4 -- FBXO21\n",
      "CNTNAP4 -- MAST3\n",
      "CNTNAP4 -- APBA1\n",
      "CNTNAP4 -- CASK\n",
      "COX16 -- NYX\n",
      "COX16 -- ERGIC3\n",
      "COX16 -- KPTN\n",
      "COX16 -- ALDH3B2\n",
      "COX16 -- FAS\n",
      "COX16 -- FCGR3B\n",
      "CRIPAK -- PAXIP1\n",
      "CRIPAK -- ECT2\n",
      "CRIPAK -- BRCA1\n",
      "CRIPAK -- BARD1\n",
      "CRIPAK -- ESR1\n",
      "CRIPAK -- PAK1\n",
      "CST9L -- NOTCH2NL\n",
      "CST9L -- KRTAP10-3\n",
      "CST9L -- KRTAP10-9\n",
      "CST9L -- CCR5\n",
      "CST9L -- TAB2\n",
      "CST9L -- SLC22A2\n",
      "DALRD3 -- ATL3\n",
      "DALRD3 -- ZDHHC17\n",
      "DALRD3 -- HNRNPK\n",
      "DALRD3 -- BRCA1\n",
      "DALRD3 -- TK1\n",
      "DALRD3 -- CSNK2B\n",
      "DCAF12 -- DDA1\n",
      "DCAF12 -- COPS6\n",
      "DCAF12 -- COPS5\n",
      "DCAF12 -- ELAVL1\n",
      "DCAF12 -- CUL4A\n",
      "DCAF12 -- DDB1\n",
      "DCAF4L2 -- CUL4A\n",
      "DCAF4L2 -- CUL4B\n",
      "DCAF4L2 -- PYGL\n",
      "DCAF4L2 -- CCT6B\n",
      "DCAF4L2 -- CLUH\n",
      "DCAF4L2 -- COPS2\n",
      "DCLRE1A -- YWHAH\n",
      "DCLRE1A -- UBC\n",
      "DCLRE1A -- PCNA\n",
      "DCLRE1A -- PIAS1\n",
      "DCLRE1A -- ATM\n",
      "DCLRE1A -- TP53BP1\n",
      "DDX49 -- HIST1H2BG\n",
      "DDX49 -- APP\n",
      "DDX49 -- NSUN2\n",
      "DDX49 -- PSMB2\n",
      "DDX49 -- PNO1\n",
      "DDX49 -- HAP1\n",
      "DGKD -- SREK1\n",
      "DGKD -- TNFRSF14\n",
      "DGKD -- DGKD\n",
      "DGKD -- IGSF21\n",
      "DGKD -- HAX1\n",
      "DGKD -- DGKH\n",
      "DHRS4L2 -- D2HGDH\n",
      "DHRS4L2 -- ACOT7\n",
      "DHRS4L2 -- ZZEF1\n",
      "DHRS4L2 -- DHRS4\n",
      "DHRS4L2 -- AARS2\n",
      "DHRS4L2 -- MTIF2\n",
      "DHX34 -- KIF3A\n",
      "DHX34 -- EXOC8\n",
      "DHX34 -- TRMT2A\n",
      "DHX34 -- RPS6KA6\n",
      "DHX34 -- GSK3B\n",
      "DHX34 -- POLA2\n",
      "DNAJC14 -- CPVL\n",
      "DNAJC14 -- SARNP\n",
      "DNAJC14 -- IGSF8\n",
      "DNAJC14 -- ELAVL1\n",
      "DNAJC14 -- DRD1\n",
      "DNAJC14 -- LYST\n",
      "DNAJC16 -- TCTN3\n",
      "DNAJC16 -- TCTN2\n",
      "DNAJC16 -- BTNL8\n",
      "DNAJC16 -- HLA-C\n",
      "DNAJC16 -- TMEM30A\n",
      "DNAJC16 -- SPINT2\n",
      "DPY19L4 -- ZACN\n",
      "DPY19L4 -- MCOLN3\n",
      "DPY19L4 -- NXF1\n",
      "DPY19L4 -- CUL5\n",
      "DPY19L4 -- CUL4B\n",
      "DPY19L4 -- ELAVL1\n",
      "DUSP4 -- MAPK9\n",
      "DUSP4 -- APP\n",
      "DUSP4 -- CRMP1\n",
      "DUSP4 -- MAPK8\n",
      "DUSP4 -- MAPK14\n",
      "DUSP4 -- MAPK3\n",
      "E2F5 -- TFDP2\n",
      "E2F5 -- KMT2D\n",
      "E2F5 -- BRCC3\n",
      "E2F5 -- RBL1\n",
      "E2F5 -- RBL2\n",
      "E2F5 -- TFDP1\n",
      "EFNA3 -- NOTCH2NL\n",
      "EFNA3 -- KRTAP10-3\n",
      "EFNA3 -- MEOX2\n",
      "EFNA3 -- EPHA3\n",
      "EFNA3 -- EPHA7\n",
      "EFNA3 -- PRSS23\n",
      "ELMOD1 -- DSG4\n",
      "ELMOD1 -- LGALS3\n",
      "ELMOD1 -- PKP3\n",
      "ELMOD1 -- LRRC15\n",
      "ELMOD1 -- SELENBP1\n",
      "ELMOD1 -- THG1L\n",
      "ELSPBP1 -- PSMD9\n",
      "ELSPBP1 -- TAL1\n",
      "ELSPBP1 -- ELSPBP1\n",
      "ELSPBP1 -- TWIST1\n",
      "ELSPBP1 -- EP300\n",
      "ELSPBP1 -- MYOD1\n",
      "EMID1 -- KRAS\n",
      "EMID1 -- YTHDF1\n",
      "EMID1 -- COLGALT2\n",
      "EMID1 -- UBR4\n",
      "EMID1 -- KLHL25\n",
      "EMID1 -- CDC5L\n",
      "ENPP4 -- KRAS\n",
      "ENPP4 -- LPAR1\n",
      "ENPP4 -- LGALS9\n",
      "ENPP4 -- SOX2\n",
      "ENPP4 -- LGALS8\n",
      "ENPP4 -- LGALS3\n",
      "ESRP2 -- FOXP3\n",
      "ESRP2 -- VPS16\n",
      "ESRP2 -- RPA1\n",
      "ESRP2 -- RPA2\n",
      "ESRP2 -- RPA3\n",
      "ESRP2 -- NUMBL\n",
      "ETV7 -- PDLIM7\n",
      "ETV7 -- ETV6\n",
      "ETV7 -- VTN\n",
      "ETV7 -- LRPAP1\n",
      "ETV7 -- IRF4\n",
      "ETV7 -- L3MBTL1\n",
      "EXD2 -- HERC2\n",
      "EXD2 -- NTRK1\n",
      "EXD2 -- GRAMD3\n",
      "EXD2 -- DCTN2\n",
      "EXD2 -- PEX19\n",
      "EXD2 -- CCDC8\n",
      "FAM120C -- SEC16A\n",
      "FAM120C -- HNRNPU\n",
      "FAM120C -- TFCP2\n",
      "FAM120C -- HNRNPA1\n",
      "FAM120C -- BANP\n",
      "FAM120C -- ISG15\n",
      "FAM133B -- PPP4R2\n",
      "FAM133B -- TSNAX\n",
      "FAM133B -- CDK2\n",
      "FAM133B -- ATR\n",
      "FAM133B -- HECW2\n",
      "FAM133B -- APP\n",
      "FAM13B -- UNK\n",
      "FAM13B -- SAMHD1\n",
      "FAM13B -- ELAVL1\n",
      "FAM13B -- YWHAZ\n",
      "FAM13B -- YWHAE\n",
      "FAM13B -- YWHAG\n",
      "FAM153B -- TYW5\n",
      "FAM153B -- EDC4\n",
      "FAM153B -- EIF2AK4\n",
      "FAM153B -- EHD1\n",
      "FAM153B -- UBB\n",
      "FAM153B -- FAM153A\n",
      "FAM160B2 -- CLK1\n",
      "FAM160B2 -- SMG8\n",
      "FAM160B2 -- ZNF318\n",
      "FAM160B2 -- RECQL4\n",
      "FAM160B2 -- DYNC2H1\n",
      "FAM160B2 -- APP\n",
      "FAM213B -- PROCR\n",
      "FAM213B -- NARS\n",
      "FAM213B -- HRAS\n",
      "FAM213B -- NUCB1\n",
      "FAM213B -- PDPK1\n",
      "FAM213B -- TNFSF11\n",
      "FAM45A -- RNF168\n",
      "FAM45A -- KBTBD7\n",
      "FAM45A -- CCDC22\n",
      "FAM45A -- CCDC93\n",
      "FAM45A -- COMMD4\n",
      "FAM45A -- COMMD3\n",
      "FASTKD1 -- SCN2B\n",
      "FASTKD1 -- ARL13B\n",
      "FASTKD1 -- LPAR6\n",
      "FASTKD1 -- SPDEF\n",
      "FASTKD1 -- KIR2DS2\n",
      "FASTKD1 -- BSG\n",
      "FAXC -- MSN\n",
      "FAXC -- ESD\n",
      "FAXC -- ALDH6A1\n",
      "FAXC -- CCT8\n",
      "FAXC -- ACADM\n",
      "FAXC -- FAXC\n",
      "FBRSL1 -- XPO1\n",
      "FBRSL1 -- CSNK2A2\n",
      "FBRSL1 -- RYBP\n",
      "FBRSL1 -- RNF2\n",
      "FBRSL1 -- PCGF5\n",
      "FBRSL1 -- PCGF3\n",
      "FBXL14 -- DICER1\n",
      "FBXL14 -- HSP90AA1\n",
      "FBXL14 -- COPS6\n",
      "FBXL14 -- COPS5\n",
      "FBXL14 -- CUL1\n",
      "FBXL14 -- SNAI1\n",
      "FBXL16 -- PPP2R2A\n",
      "FBXL16 -- PPP2R1A\n",
      "FBXL16 -- MARK2\n",
      "FBXL16 -- LATS2\n",
      "FBXL16 -- HPCAL4\n",
      "FBXL16 -- MAPK6\n",
      "FBXO15 -- CPA6\n",
      "FBXO15 -- HINT3\n",
      "FBXO15 -- OS9\n",
      "FBXO15 -- CRLS1\n",
      "FBXO15 -- UBA7\n",
      "FBXO15 -- ABCB1\n",
      "FLYWCH1 -- NFATC1\n",
      "FLYWCH1 -- KIF11\n",
      "FLYWCH1 -- HTATSF1\n",
      "FLYWCH1 -- BRCA1\n",
      "FLYWCH1 -- ELAVL1\n",
      "FLYWCH1 -- SETDB1\n",
      "FMNL3 -- NTRK1\n",
      "FMNL3 -- CIAO1\n",
      "FMNL3 -- FAM96B\n",
      "FMNL3 -- MMS19\n",
      "FMNL3 -- APP\n",
      "FMNL3 -- PRPF40A\n",
      "FRMD8 -- FRMD8P1\n",
      "FRMD8 -- PLEKHF2\n",
      "FRMD8 -- GRAMD3\n",
      "FRMD8 -- APP\n",
      "FRMD8 -- ELAVL1\n",
      "FRMD8 -- IKBKG\n",
      "GAB3 -- ABL1\n",
      "GAB3 -- GRB2\n",
      "GAB3 -- LYN\n",
      "GAB3 -- FYN\n",
      "GAB3 -- SRC\n",
      "GAB3 -- PTPN11\n",
      "GABPB2 -- PLCG2\n",
      "GABPB2 -- CRK\n",
      "GABPB2 -- ZDHHC17\n",
      "GABPB2 -- GORASP2\n",
      "GABPB2 -- KDM1A\n",
      "GABPB2 -- RYBP\n",
      "GALNT18 -- PTPRK\n",
      "GALNT18 -- TMEM25\n",
      "GALNT18 -- PLAUR\n",
      "GALNT18 -- IDS\n",
      "GALNT18 -- TAZ\n",
      "GALNT18 -- CEP250\n",
      "GAREM -- XPO1\n",
      "GAREM -- CRK\n",
      "GAREM -- NTRK1\n",
      "GAREM -- GRAP2\n",
      "GAREM -- CRKL\n",
      "GAREM -- GRB2\n",
      "GAS8 -- LRP6\n",
      "GAS8 -- HEATR6\n",
      "GAS8 -- IQCB1\n",
      "GAS8 -- TP73\n",
      "GAS8 -- TP63\n",
      "GAS8 -- CIAO1\n",
      "GATSL3 -- WDR59\n",
      "GATSL3 -- WDR24\n",
      "GATSL3 -- MIOS\n",
      "GATSL3 -- GATSL2\n",
      "GATSL3 -- GATSL3\n",
      "GATSL3 -- ZC2HC1A\n",
      "GDPD5 -- LYPD3\n",
      "GDPD5 -- KRTAP26-1\n",
      "GDPD5 -- TRIP6\n",
      "GDPD5 -- SIAH1\n",
      "GDPD5 -- PEX5\n",
      "GDPD5 -- PLSCR1\n",
      "GLRX2 -- PITPNB\n",
      "GLRX2 -- MDH2\n",
      "GLRX2 -- GPX4\n",
      "GLRX2 -- CYCS\n",
      "GLRX2 -- BAG3\n",
      "GLRX2 -- TXNRD1\n",
      "GLTSCR1L -- RAB5C\n",
      "GLTSCR1L -- SMARCD1\n",
      "GLTSCR1L -- ELAVL1\n",
      "GLTSCR1L -- DTNBP1\n",
      "GLTSCR1L -- CDC5L\n",
      "GLTSCR1L -- NFYC\n",
      "GNGT2 -- SRPK2\n",
      "GNGT2 -- GNB3\n",
      "GNGT2 -- GNB1\n",
      "GNGT2 -- GNB4\n",
      "GNGT2 -- GNB2\n",
      "GNGT2 -- KCNJ4\n",
      "GPBP1 -- SORT1\n",
      "GPBP1 -- HNRNPD\n",
      "GPBP1 -- PLEKHF2\n",
      "GPBP1 -- C20orf195\n",
      "GPBP1 -- DNAL4\n",
      "GPBP1 -- MCRS1\n",
      "GPC1 -- PTEN\n",
      "GPC1 -- GPR183\n",
      "GPC1 -- FGF1\n",
      "GPC1 -- PFDN5\n",
      "GPC1 -- SLIT2\n",
      "GPC1 -- VEGFA\n",
      "GPR137B -- NCAPG\n",
      "GPR137B -- DOC2A\n",
      "GPR137B -- NCAPH\n",
      "GPR137B -- ZYG11B\n",
      "GPR137B -- SMC2\n",
      "GPR137B -- NCAPD2\n",
      "GPRIN1 -- ZNF281\n",
      "GPRIN1 -- YEATS4\n",
      "GPRIN1 -- HNRNPD\n",
      "GPRIN1 -- NTRK1\n",
      "GPRIN1 -- TMEM185A\n",
      "GPRIN1 -- SDF4\n",
      "GRAMD1C -- APP\n",
      "GRAMD1C -- SCARA3\n",
      "GRAMD1C -- EVA1C\n",
      "GRAMD1C -- GRAMD3\n",
      "GRAMD1C -- FIBP\n",
      "GRAMD1C -- CD151\n",
      "GRIP2 -- KRAS\n",
      "GRIP2 -- GFI1B\n",
      "GRIP2 -- GIT1\n",
      "GRIP2 -- ERC2\n",
      "GRIP2 -- PPFIA1\n",
      "GRIP2 -- CSPG4\n",
      "GSDMA -- MCM2\n",
      "GSDMA -- FOXH1\n",
      "GSDMA -- CEP152\n",
      "GSDMA -- IFI16\n",
      "GSDMA -- SUZ12\n",
      "GSDMA -- PARK2\n",
      "GTF2H2C -- XPO1\n",
      "GTF2H2C -- GTF2H4\n",
      "GTF2H2C -- GTF2H3\n",
      "GTF2H2C -- GTF2H1\n",
      "GTF2H2C -- ERCC3\n",
      "GTF2H2C -- GTF2H2C_2\n",
      "GUCY1B3 -- LIN7A\n",
      "GUCY1B3 -- APP\n",
      "GUCY1B3 -- STUB1\n",
      "GUCY1B3 -- GUCY1A2\n",
      "GUCY1B3 -- HSP90AA1\n",
      "GUCY1B3 -- NOS3\n",
      "HEBP1 -- UBE2L3\n",
      "HEBP1 -- SNX3\n",
      "HEBP1 -- S100A6\n",
      "HEBP1 -- PCBP1\n",
      "HEBP1 -- COTL1\n",
      "HEBP1 -- DHX36\n",
      "HELZ2 -- IFI16\n",
      "HELZ2 -- BMI1\n",
      "HELZ2 -- ISG15\n",
      "HELZ2 -- SIRT7\n",
      "HELZ2 -- BCL6\n",
      "HELZ2 -- PPARA\n",
      "HES4 -- SHMT2\n",
      "HES4 -- COPG2\n",
      "HES4 -- RGS3\n",
      "HES4 -- LTN1\n",
      "HES4 -- PCBD2\n",
      "HES4 -- PCBD1\n",
      "HID1 -- CSDE1\n",
      "HID1 -- INPPL1\n",
      "HID1 -- RCN3\n",
      "HID1 -- CBS\n",
      "HID1 -- RBBP8\n",
      "HID1 -- BEGAIN\n",
      "HIST1H3F -- MCM2\n",
      "HIST1H3F -- ITGA4\n",
      "HIST1H3F -- TRIM24\n",
      "HIST1H3F -- HDGF\n",
      "HIST1H3F -- PHF1\n",
      "HIST1H3F -- ASF1B\n",
      "HIST1H3G -- MCM2\n",
      "HIST1H3G -- ITGA4\n",
      "HIST1H3G -- TRIM24\n",
      "HIST1H3G -- HDGF\n",
      "HIST1H3G -- PHF1\n",
      "HIST1H3G -- NASP\n",
      "HIST2H2AA4 -- MCM2\n",
      "HIST2H2AA4 -- HIST1H3A\n",
      "HIST2H2AA4 -- HIST1H2BG\n",
      "HIST2H2AA4 -- OBSL1\n",
      "HIST2H2AA4 -- CUL7\n",
      "HIST2H2AA4 -- CHD1L\n",
      "HLA-DQB2 -- PRL\n",
      "HLA-DQB2 -- ERAP1\n",
      "HLA-DQB2 -- TRMT44\n",
      "HLA-DQB2 -- COL14A1\n",
      "HLA-DQB2 -- ATE1\n",
      "HLA-DQB2 -- OAF\n",
      "HMGN5 -- ZC3H15\n",
      "HMGN5 -- RRP9\n",
      "HMGN5 -- HSPB1\n",
      "HMGN5 -- C11orf58\n",
      "HMGN5 -- BASP1\n",
      "HMGN5 -- CBX8\n",
      "HMGXB3 -- PFDN1\n",
      "HMGXB3 -- ANXA7\n",
      "HMGXB3 -- SMN1\n",
      "HMGXB3 -- CDK4\n",
      "HMGXB3 -- CDKN1A\n",
      "HMGXB3 -- TK1\n",
      "HOXC10 -- ESR1\n",
      "HOXC10 -- NXF1\n",
      "HOXC10 -- EGFR\n",
      "HOXC10 -- NUP205\n",
      "HOXC10 -- YWHAG\n",
      "HOXC10 -- CWC27\n",
      "HRASLS5 -- CLK1\n",
      "HRASLS5 -- VCPIP1\n",
      "HRASLS5 -- LOC155060\n",
      "HRASLS5 -- GGACT\n",
      "HRASLS5 -- GOLGA2\n",
      "HRASLS5 -- APP\n",
      "HRK -- ELAVL1\n",
      "HRK -- BCL2L1\n",
      "HRK -- BCL2A1\n",
      "HRK -- MCL1\n",
      "HRK -- BCL2L2\n",
      "HRK -- BCL2\n",
      "HS1BP3 -- CEP170\n",
      "HS1BP3 -- NAA38\n",
      "HS1BP3 -- RWDD2B\n",
      "HS1BP3 -- TMED3\n",
      "HS1BP3 -- ZDHHC17\n",
      "HS1BP3 -- VCP\n",
      "HSPBAP1 -- FOXD4L6\n",
      "HSPBAP1 -- MAGEA1\n",
      "HSPBAP1 -- NUTM1\n",
      "HSPBAP1 -- ARHGEF5\n",
      "HSPBAP1 -- TK1\n",
      "HSPBAP1 -- PTN\n",
      "HTR3E -- ARL6IP5\n",
      "HTR3E -- CYP51A1\n",
      "HTR3E -- AMFR\n",
      "HTR3E -- DHRS7\n",
      "HTR3E -- GET4\n",
      "HTR3E -- ATP2A3\n",
      "IKZF5 -- IKZF3\n",
      "IKZF5 -- IKZF1\n",
      "IKZF5 -- IKZF4\n",
      "IKZF5 -- IKZF5\n",
      "IKZF5 -- LDOC1\n",
      "IKZF5 -- CCDC85B\n",
      "IL37 -- GSG1\n",
      "IL37 -- FADD\n",
      "IL37 -- IL37\n",
      "IL37 -- IL18R1\n",
      "IL37 -- CASP4\n",
      "IL37 -- CASP1\n",
      "INHBB -- ACVR1C\n",
      "INHBB -- FNTA\n",
      "INHBB -- IGSF1\n",
      "INHBB -- ACVR1B\n",
      "INHBB -- ACVR2B\n",
      "INHBB -- ACVR2A\n",
      "INPP5J -- TRIM54\n",
      "INPP5J -- DNAJA3\n",
      "INPP5J -- CDC23\n",
      "INPP5J -- TRIM27\n",
      "INPP5J -- GOLGA2\n",
      "INPP5J -- EPS8\n",
      "IRGQ -- ZSCAN26\n",
      "IRGQ -- PLK2\n",
      "IRGQ -- NTRK1\n",
      "IRGQ -- XPNPEP1\n",
      "IRGQ -- NFYA\n",
      "IRGQ -- GABARAPL2\n",
      "ITFG2 -- HSPB9\n",
      "ITFG2 -- INPP5A\n",
      "ITFG2 -- BTN2A1\n",
      "ITFG2 -- SNX24\n",
      "ITFG2 -- C1QTNF2\n",
      "ITFG2 -- KPTN\n",
      "ITM2C -- TMEM216\n",
      "ITM2C -- TMEM17\n",
      "ITM2C -- MVB12B\n",
      "ITM2C -- CUL7\n",
      "ITM2C -- RYK\n",
      "ITM2C -- RNF7\n",
      "ITPRIP -- HTR3C\n",
      "ITPRIP -- PLTP\n",
      "ITPRIP -- ATP1B4\n",
      "ITPRIP -- RASSF1\n",
      "ITPRIP -- CD1B\n",
      "ITPRIP -- FBXO6\n",
      "ITPRIPL1 -- GPR183\n",
      "ITPRIPL1 -- SPINT2\n",
      "ITPRIPL1 -- CD3E\n",
      "ITPRIPL1 -- UBQLN1\n",
      "ITPRIPL1 -- SGTA\n",
      "ITPRIPL1 -- UBQLN4\n",
      "JMY -- MYO1C\n",
      "JMY -- MYH9\n",
      "JMY -- PPP1R1A\n",
      "JMY -- VAPB\n",
      "JMY -- CCDC136\n",
      "JMY -- EP300\n",
      "KDELR3 -- MCM2\n",
      "KDELR3 -- DPEP2\n",
      "KDELR3 -- VSIG4\n",
      "KDELR3 -- LPAR6\n",
      "KDELR3 -- SLC39A4\n",
      "KDELR3 -- TMEM171\n",
      "KDM4D -- HECW2\n",
      "KDM4D -- PPP1CC\n",
      "KDM4D -- CUL4B\n",
      "KDM4D -- TP53\n",
      "KDM4D -- AR\n",
      "KDM4D -- KDM4D\n",
      "KIAA0430 -- DCP1A\n",
      "KIAA0430 -- GTSE1\n",
      "KIAA0430 -- CRKL\n",
      "KIAA0430 -- CLTC\n",
      "KIAA0430 -- ELAVL1\n",
      "KIAA0430 -- TERF2\n",
      "KIAA1161 -- SIAE\n",
      "KIAA1161 -- PTCH1\n",
      "KIAA1161 -- DLK1\n",
      "KIAA1161 -- ATP1B4\n",
      "KIAA1161 -- LYPD3\n",
      "KIAA1161 -- FBXO6\n",
      "KIAA1328 -- CCDC14\n",
      "KIAA1328 -- FGFR1OP\n",
      "KIAA1328 -- CEP135\n",
      "KIAA1328 -- OFD1\n",
      "KIAA1328 -- PCM1\n",
      "KIAA1328 -- APC\n",
      "KIF24 -- TSNAX\n",
      "KIF24 -- RPS19BP1\n",
      "KIF24 -- DOT1L\n",
      "KIF24 -- CEP97\n",
      "KIF24 -- JAK1\n",
      "KIF24 -- PRKAA2\n",
      "KLRF1 -- TP53\n",
      "KLRF1 -- REEP6\n",
      "KLRF1 -- CBWD1\n",
      "KLRF1 -- REEP5\n",
      "KLRF1 -- TOMM40\n",
      "KLRF1 -- GAPDHS\n",
      "KRBA1 -- PRMT2\n",
      "KRBA1 -- RFPL4B\n",
      "KRBA1 -- KLHL20\n",
      "KRBA1 -- PLK1\n",
      "KRBA1 -- GSK3B\n",
      "KRBA1 -- GSK3A\n",
      "KRT34 -- HNRNPA1\n",
      "KRT34 -- EPS15\n",
      "KRT34 -- GRB2\n",
      "KRT34 -- USP15\n",
      "KRT34 -- DLG3\n",
      "KRT34 -- PLEKHB2\n",
      "KRT72 -- MYO19\n",
      "KRT72 -- TRRAP\n",
      "KRT72 -- HSPB1\n",
      "KRT72 -- KRT40\n",
      "KRT72 -- KRT18\n",
      "KRT72 -- KRT17\n",
      "LAX1 -- CREB1\n",
      "LAX1 -- STAMBPL1\n",
      "LAX1 -- GRB7\n",
      "LAX1 -- NDN\n",
      "LAX1 -- GRAP2\n",
      "LAX1 -- GRB2\n",
      "LCN1 -- NTRK1\n",
      "LCN1 -- PDYN\n",
      "LCN1 -- PECR\n",
      "LCN1 -- WWOX\n",
      "LCN1 -- LMBR1L\n",
      "LCN1 -- KHK\n",
      "LCN15 -- ATG4A\n",
      "LCN15 -- SETX\n",
      "LCN15 -- NUDT15\n",
      "LCN15 -- DIS3L\n",
      "LCN15 -- ALKBH2\n",
      "LCN15 -- MYO9B\n",
      "LIX1L -- TRIM25\n",
      "LIX1L -- GGA1\n",
      "LIX1L -- EIF4H\n",
      "LIX1L -- CAPNS2\n",
      "LIX1L -- NXF1\n",
      "LIX1L -- MOV10\n",
      "LOC155060 -- NXF1\n",
      "LOC155060 -- SHMT2\n",
      "LOC155060 -- LOC155060\n",
      "LOC155060 -- HRASLS5\n",
      "LOC155060 -- ZNF398\n",
      "LOC155060 -- ZNF212\n",
      "LOH12CR1 -- BCAS4\n",
      "LOH12CR1 -- C17orf59\n",
      "LOH12CR1 -- FGL1\n",
      "LOH12CR1 -- TEX35\n",
      "LOH12CR1 -- FBXO25\n",
      "LOH12CR1 -- PUF60\n",
      "LY6G5B -- TUBGCP3\n",
      "LY6G5B -- TP53\n",
      "LY6G5B -- NEDD1\n",
      "LY6G5B -- CEP57\n",
      "LY6G5B -- VCAM1\n",
      "LY6G5B -- FN1\n",
      "LYG2 -- PYHIN1\n",
      "LYG2 -- APIP\n",
      "LYG2 -- SGOL2\n",
      "LYG2 -- DOLPP1\n",
      "LYG2 -- RAB11B\n",
      "LYG2 -- TEX35\n",
      "MAGEB1 -- SRPK1\n",
      "MAGEB1 -- SRPK2\n",
      "MAGEB1 -- EID2\n",
      "MAGEB1 -- EID3\n",
      "MAGEB1 -- NSMCE4A\n",
      "MAGEB1 -- NEDD4L\n",
      "MAML2 -- RBPJ\n",
      "MAML2 -- EP300\n",
      "MAML2 -- CREBBP\n",
      "MAML2 -- DIABLO\n",
      "MAML2 -- NOTCH1\n",
      "MAML2 -- MAML1\n",
      "MAP3K7CL -- AK8\n",
      "MAP3K7CL -- REL\n",
      "MAP3K7CL -- KRT31\n",
      "MAP3K7CL -- CISH\n",
      "MAP3K7CL -- GPS2\n",
      "MAP3K7CL -- TAB3\n",
      "MBNL3 -- MBNL1\n",
      "MBNL3 -- NXF1\n",
      "MBNL3 -- MOV10\n",
      "MBNL3 -- SHMT2\n",
      "MBNL3 -- DAB1\n",
      "MBNL3 -- SRPK1\n",
      "MCM9 -- THBS3\n",
      "MCM9 -- FAF2\n",
      "MCM9 -- MCM8\n",
      "MCM9 -- PLAUR\n",
      "MCM9 -- MCMBP\n",
      "MCM9 -- CAND1\n",
      "MDFIC -- SOCS4\n",
      "MDFIC -- RPS6KA5\n",
      "MDFIC -- CSNK2A1\n",
      "MDFIC -- CDK9\n",
      "MDFIC -- MDFIC\n",
      "MDFIC -- CCNT1\n",
      "MEGF6 -- GFI1B\n",
      "MEGF6 -- ATN1\n",
      "MEGF6 -- CRKL\n",
      "MEGF6 -- CACNA1A\n",
      "MEGF6 -- ATXN7\n",
      "MEGF6 -- EGFR\n",
      "METTL15 -- UBR2\n",
      "METTL15 -- LIPT1\n",
      "METTL15 -- BSG\n",
      "METTL15 -- MVB12B\n",
      "METTL15 -- TRIP13\n",
      "METTL15 -- CUL3\n",
      "MIEF2 -- AGTRAP\n",
      "MIEF2 -- DNM1L\n",
      "MIEF2 -- UBQLN4\n",
      "MIEF2 -- UBQLN1\n",
      "MIEF2 -- RABAC1\n",
      "MIEF2 -- PSMF1\n",
      "MRPS17 -- VPS16\n",
      "MRPS17 -- THOC1\n",
      "MRPS17 -- ECSIT\n",
      "MRPS17 -- MED4\n",
      "MRPS17 -- RNF2\n",
      "MRPS17 -- ICT1\n",
      "MSH5 -- SGTB\n",
      "MSH5 -- XRCC5\n",
      "MSH5 -- XPO1\n",
      "MSH5 -- ABL1\n",
      "MSH5 -- GPS2\n",
      "MSH5 -- MSH4\n",
      "MTG1 -- ISLR\n",
      "MTG1 -- DOCK8\n",
      "MTG1 -- APP\n",
      "MTG1 -- PRNP\n",
      "MTG1 -- ICT1\n",
      "MTG1 -- STRN4\n",
      "MYO1G -- THOC5\n",
      "MYO1G -- RPL10\n",
      "MYO1G -- SVIL\n",
      "MYO1G -- TFRC\n",
      "MYO1G -- RALA\n",
      "MYO1G -- SRGAP2\n",
      "NAGPA -- AP2M1\n",
      "NAGPA -- SLAMF7\n",
      "NAGPA -- ZHX2\n",
      "NAGPA -- DEGS1\n",
      "NAGPA -- AP2A1\n",
      "NAGPA -- EPS15\n",
      "NBPF22P -- PARVG\n",
      "NBPF22P -- ENKD1\n",
      "NBPF22P -- LMO3\n",
      "NBPF22P -- RGP1\n",
      "NBPF22P -- SMARCE1\n",
      "NBPF22P -- AQP1\n",
      "NDUFAF7 -- OXLD1\n",
      "NDUFAF7 -- RD3\n",
      "NDUFAF7 -- FNTB\n",
      "NDUFAF7 -- ST3GAL5\n",
      "NDUFAF7 -- NDUFA10\n",
      "NDUFAF7 -- APP\n",
      "NEIL2 -- EP300\n",
      "NEIL2 -- TRIM27\n",
      "NEIL2 -- REL\n",
      "NEIL2 -- MEOX1\n",
      "NEIL2 -- ELAVL1\n",
      "NEIL2 -- KEAP1\n",
      "NEK3 -- CDK13\n",
      "NEK3 -- VSIG4\n",
      "NEK3 -- CDCA8\n",
      "NEK3 -- BPGM\n",
      "NEK3 -- NMNAT1\n",
      "NEK3 -- HDAC6\n",
      "NFXL1 -- FOXL1\n",
      "NFXL1 -- WDFY2\n",
      "NFXL1 -- RNF2\n",
      "NFXL1 -- CLINT1\n",
      "NFXL1 -- ILF3\n",
      "NFXL1 -- SARM1\n",
      "NLRP4 -- SH3BP1\n",
      "NLRP4 -- SUGT1\n",
      "NLRP4 -- HSP90AA1\n",
      "NLRP4 -- DTX4\n",
      "NLRP4 -- TBK1\n",
      "NLRP4 -- CHUK\n",
      "NMUR2 -- NOTCH2NL\n",
      "NMUR2 -- KRTAP13-1\n",
      "NMUR2 -- ADAMTSL4\n",
      "NMUR2 -- TRAF2\n",
      "NMUR2 -- TCF4\n",
      "NMUR2 -- NMU\n",
      "NNMT -- CRYZ\n",
      "NNMT -- ADK\n",
      "NNMT -- GLOD4\n",
      "NNMT -- BMF\n",
      "NNMT -- ATF6\n",
      "NNMT -- APP\n",
      "NOMO3 -- EWSR1\n",
      "NOMO3 -- TMEM25\n",
      "NOMO3 -- FBXO6\n",
      "NOMO3 -- LIG4\n",
      "NOMO3 -- UBQLN4\n",
      "NOMO3 -- RYK\n",
      "NR2C2AP -- FKBP2\n",
      "NR2C2AP -- SLC16A3\n",
      "NR2C2AP -- TCF4\n",
      "NR2C2AP -- REL\n",
      "NR2C2AP -- BAG3\n",
      "NR2C2AP -- NR2C2\n",
      "NREP -- ATM\n",
      "NREP -- MAGED1\n",
      "NREP -- ELAVL1\n",
      "NREP -- EEF1A1\n",
      "NREP -- KMT2B\n",
      "NREP -- IGSF21\n",
      "NUDT19 -- CEP19\n",
      "NUDT19 -- OXLD1\n",
      "NUDT19 -- SLC25A41\n",
      "NUDT19 -- PEX5\n",
      "NUDT19 -- NPC2\n",
      "NUDT19 -- SLC9A3R2\n",
      "NXF2 -- LUZP4\n",
      "NXF2 -- APP\n",
      "NXF2 -- NXF1\n",
      "NXF2 -- NUP62\n",
      "NXF2 -- NUP153\n",
      "NXF2 -- NUP214\n",
      "NXF5 -- CCT7\n",
      "NXF5 -- CCT3\n",
      "NXF5 -- CCT8\n",
      "NXF5 -- HSPA6\n",
      "NXF5 -- HSPA8\n",
      "NXF5 -- NXF1\n",
      "OBP2A -- TXNDC15\n",
      "OBP2A -- COL6A2\n",
      "OBP2A -- MOXD1\n",
      "OBP2A -- CLN5\n",
      "OBP2A -- LRP2\n",
      "OBP2A -- OBP2B\n",
      "ODF1 -- KRTAP12-2\n",
      "ODF1 -- MTUS2\n",
      "ODF1 -- CDK5R1\n",
      "ODF1 -- CDK5\n",
      "ODF1 -- TRIP6\n",
      "ODF1 -- SPAG4\n",
      "ONECUT1 -- NR0B2\n",
      "ONECUT1 -- NR3C1\n",
      "ONECUT1 -- FOXA2\n",
      "ONECUT1 -- FOXA1\n",
      "ONECUT1 -- KAT2B\n",
      "ONECUT1 -- CREBBP\n",
      "ORAOV1 -- ABCE1\n",
      "ORAOV1 -- MMS19\n",
      "ORAOV1 -- YAE1D1\n",
      "ORAOV1 -- MSH3\n",
      "ORAOV1 -- CAND1\n",
      "ORAOV1 -- ELAVL1\n",
      "OSBPL2 -- BAG6\n",
      "OSBPL2 -- SGTB\n",
      "OSBPL2 -- HNRNPD\n",
      "OSBPL2 -- APBB2\n",
      "OSBPL2 -- VAPB\n",
      "OSBPL2 -- ELAVL1\n",
      "OXSM -- DHRS4\n",
      "OXSM -- NDUFAB1\n",
      "OXSM -- SOX2\n",
      "OXSM -- ATF6B\n",
      "OXSM -- GTF2B\n",
      "OXSM -- APP\n",
      "PANX1 -- FBXO7\n",
      "PANX1 -- CDC37\n",
      "PANX1 -- BAG3\n",
      "PANX1 -- TMEM17\n",
      "PANX1 -- C4orf3\n",
      "PANX1 -- GNAS\n",
      "PCDHGC3 -- NTRK1\n",
      "PCDHGC3 -- C2orf48\n",
      "PCDHGC3 -- CEACAM21\n",
      "PCDHGC3 -- MFSD3\n",
      "PCDHGC3 -- HGD\n",
      "PCDHGC3 -- APP\n",
      "PCYT1B -- PAXIP1\n",
      "PCYT1B -- APP\n",
      "PCYT1B -- KIAA0368\n",
      "PCYT1B -- ACTA1\n",
      "PCYT1B -- ACTA2\n",
      "PCYT1B -- ACTB\n",
      "PDXP -- STK11\n",
      "PDXP -- NTRK1\n",
      "PDXP -- NXF1\n",
      "PDXP -- MOV10\n",
      "PDXP -- ARRB1\n",
      "PDXP -- MED23\n",
      "PFKFB1 -- PFKFB1\n",
      "PFKFB1 -- APP\n",
      "PFKFB1 -- PRKACA\n",
      "PFKFB1 -- AKT1\n",
      "PFKFB1 -- PRKCA\n",
      "PFKFB1 -- MAPK3\n",
      "PHF23 -- FOXK2\n",
      "PHF23 -- STK11\n",
      "PHF23 -- ERBB2\n",
      "PHF23 -- LRSAM1\n",
      "PHF23 -- HCCS\n",
      "PHF23 -- PRSS23\n",
      "PIGQ -- TNFSF13B\n",
      "PIGQ -- SMAD1\n",
      "PIGQ -- PIGA\n",
      "PIGQ -- PIGC\n",
      "PIGQ -- PIGH\n",
      "PIGQ -- PIGP\n",
      "PIH1D3 -- KIF13A\n",
      "PIH1D3 -- CCAR1\n",
      "PIH1D3 -- CDKL3\n",
      "PIH1D3 -- KAT5\n",
      "PIH1D3 -- BTAF1\n",
      "PIH1D3 -- P2RX4\n",
      "PLCZ1 -- HBD\n",
      "PLCZ1 -- HAL\n",
      "PLCZ1 -- SERPINA12\n",
      "PLCZ1 -- SEMG1\n",
      "PLCZ1 -- CST6\n",
      "PLCZ1 -- KLK7\n",
      "PLEKHA4 -- PRKAA1\n",
      "PLEKHA4 -- CCNG1\n",
      "PLEKHA4 -- SETDB1\n",
      "PLEKHA4 -- LRIF1\n",
      "PLEKHA4 -- KAT5\n",
      "PLEKHA4 -- EEF1G\n",
      "PLEKHA6 -- XPO1\n",
      "PLEKHA6 -- NTRK1\n",
      "PLEKHA6 -- MYBPHL\n",
      "PLEKHA6 -- CFTR\n",
      "PLEKHA6 -- APOE\n",
      "PLEKHA6 -- PLEKHA5\n",
      "PLSCR3 -- CATSPER1\n",
      "PLSCR3 -- STK16\n",
      "PLSCR3 -- ALG2\n",
      "PLSCR3 -- PRKCD\n",
      "PLSCR3 -- TRIP13\n",
      "PLSCR3 -- PLSCR1\n",
      "PLXNB3 -- MAGI3\n",
      "PLXNB3 -- BTBD3\n",
      "PLXNB3 -- MAGI2\n",
      "PLXNB3 -- SPOCK2\n",
      "PLXNB3 -- CUL7\n",
      "PLXNB3 -- ARHGEF11\n",
      "PRAP1 -- IGHA1\n",
      "PRAP1 -- CD48\n",
      "PRAP1 -- LACRT\n",
      "PRAP1 -- UBQLN1\n",
      "PRAP1 -- SGTA\n",
      "PRAP1 -- GRB2\n",
      "PRDM10 -- FOXK2\n",
      "PRDM10 -- CASQ2\n",
      "PRDM10 -- TMEFF1\n",
      "PRDM10 -- REL\n",
      "PRDM10 -- CUL1\n",
      "PRDM10 -- BAP1\n",
      "PRKX -- XPO1\n",
      "PRKX -- PRKAR2B\n",
      "PRKX -- HSP90AA1\n",
      "PRKX -- NEDD4L\n",
      "PRKX -- NEDD4\n",
      "PRKX -- PRKAR1A\n",
      "PRR16 -- ABI2\n",
      "PRR16 -- PPP1CC\n",
      "PRR16 -- APP\n",
      "PRR16 -- PPP1CA\n",
      "PRR16 -- NEDD4L\n",
      "PRR16 -- NEDD4\n",
      "PRSS21 -- MBOAT1\n",
      "PRSS21 -- RTEL1\n",
      "PRSS21 -- NCSTN\n",
      "PRSS21 -- TUBG1\n",
      "PRSS21 -- LGALS3BP\n",
      "PRSS21 -- FBXO6\n",
      "PTPN7 -- MAPK14\n",
      "PTPN7 -- CCDC57\n",
      "PTPN7 -- GMCL1\n",
      "PTPN7 -- APP\n",
      "PTPN7 -- MAPK3\n",
      "PTPN7 -- MAPK1\n",
      "PTPRR -- CEP290\n",
      "PTPRR -- NTRK1\n",
      "PTPRR -- MAPK14\n",
      "PTPRR -- MAPK7\n",
      "PTPRR -- MAPK3\n",
      "PTPRR -- MAPK1\n",
      "PTTG1IP -- STX7\n",
      "PTTG1IP -- LDLRAD1\n",
      "PTTG1IP -- CLEC7A\n",
      "PTTG1IP -- TP53\n",
      "PTTG1IP -- RAB4A\n",
      "PTTG1IP -- PTTG1\n",
      "PUS7L -- STAT5B\n",
      "PUS7L -- GAK\n",
      "PUS7L -- TRIM41\n",
      "PUS7L -- TRIM27\n",
      "PUS7L -- UBC\n",
      "PUS7L -- APP\n",
      "QRICH2 -- PANK2\n",
      "QRICH2 -- NUP98\n",
      "QRICH2 -- GAPDH\n",
      "QRICH2 -- MPDU1\n",
      "QRICH2 -- SNAI1\n",
      "QRICH2 -- SSSCA1\n",
      "RAB27B -- SYTL5\n",
      "RAB27B -- DHPS\n",
      "RAB27B -- MLPH\n",
      "RAB27B -- SYTL2\n",
      "RAB27B -- SYTL1\n",
      "RAB27B -- SYTL4\n",
      "RAB39A -- KLK8\n",
      "RAB39A -- BLZF1\n",
      "RAB39A -- GOLGA2\n",
      "RAB39A -- UBL4A\n",
      "RAB39A -- APP\n",
      "RAB39A -- RAB3GAP1\n",
      "RAC3 -- RHOC\n",
      "RAC3 -- FBXL19\n",
      "RAC3 -- ESR1\n",
      "RAC3 -- ARHGDIA\n",
      "RAC3 -- ARHGDIB\n",
      "RAC3 -- CIB1\n",
      "RALGAPA1 -- CEP63\n",
      "RALGAPA1 -- AP2M1\n",
      "RALGAPA1 -- GFOD1\n",
      "RALGAPA1 -- SLMAP\n",
      "RALGAPA1 -- TERF2\n",
      "RALGAPA1 -- TERF1\n",
      "RASA3 -- GAPVD1\n",
      "RASA3 -- ARHGAP19\n",
      "RASA3 -- SPTB\n",
      "RASA3 -- APP\n",
      "RASA3 -- GNB2L1\n",
      "RASA3 -- HCK\n",
      "RASL11B -- BAG3\n",
      "RASL11B -- APP\n",
      "RASL11B -- LNX1\n",
      "RASL11B -- NEDD4L\n",
      "RASL11B -- NEDD4\n",
      "RASL11B -- EWSR1\n",
      "RBP7 -- DOK4\n",
      "RBP7 -- DAPP1\n",
      "RBP7 -- APPL2\n",
      "RBP7 -- SOCS4\n",
      "RBP7 -- PIK3R3\n",
      "RBP7 -- HSH2D\n",
      "RCOR2 -- CTBP1\n",
      "RCOR2 -- HMG20B\n",
      "RCOR2 -- SUMO2\n",
      "RCOR2 -- HDAC11\n",
      "RCOR2 -- HDAC1\n",
      "RCOR2 -- HDAC2\n",
      "REM1 -- SULT1A4\n",
      "REM1 -- WBSCR22\n",
      "REM1 -- YWHAE\n",
      "REM1 -- YWHAH\n",
      "REM1 -- YWHAZ\n",
      "REM1 -- YWHAQ\n",
      "RHEBL1 -- APPL1\n",
      "RHEBL1 -- FHL3\n",
      "RHEBL1 -- MTOR\n",
      "RHEBL1 -- PRKAB2\n",
      "RHEBL1 -- TRAF2\n",
      "RHEBL1 -- TXNL4A\n",
      "RHOBTB1 -- MYC\n",
      "RHOBTB1 -- HSP90AA1\n",
      "RHOBTB1 -- CUL5\n",
      "RHOBTB1 -- COPS6\n",
      "RHOBTB1 -- COPS5\n",
      "RHOBTB1 -- CUL3\n",
      "RILPL2 -- KRAS\n",
      "RILPL2 -- MOV10\n",
      "RILPL2 -- CAND1\n",
      "RILPL2 -- TUBB3\n",
      "RILPL2 -- HEXDC\n",
      "RILPL2 -- RILPL2\n",
      "RIPPLY1 -- THAP1\n",
      "RIPPLY1 -- HDAC7\n",
      "RIPPLY1 -- RBPMS\n",
      "RIPPLY1 -- TRAF2\n",
      "RIPPLY1 -- REL\n",
      "RIPPLY1 -- MDFI\n",
      "ROR1 -- TMEM17\n",
      "ROR1 -- TBC1D4\n",
      "ROR1 -- TBC1D1\n",
      "ROR1 -- MORC3\n",
      "ROR1 -- TRIM21\n",
      "ROR1 -- APP\n",
      "RP9P -- RP9P\n",
      "RP9P -- SREK1IP1\n",
      "RP9P -- THAP1\n",
      "RP9P -- PRR13\n",
      "RP9P -- RBM39\n",
      "RP9P -- SDCBP\n",
      "RPL41 -- NUPR1\n",
      "RPL41 -- SRPK2\n",
      "RPL41 -- APP\n",
      "RPL41 -- PRNP\n",
      "RPL41 -- MAPK14\n",
      "RPL41 -- IKBKG\n",
      "RPS26P54 -- CAND1\n",
      "RPS26P54 -- COPS5\n",
      "RPS26P54 -- CUL1\n",
      "RPS26P54 -- CUL5\n",
      "RPS26P54 -- CUL4B\n",
      "RPS26P54 -- CUL3\n",
      "RWDD3 -- VHL\n",
      "RWDD3 -- NXF1\n",
      "RWDD3 -- HIF1A\n",
      "RWDD3 -- NFKBIA\n",
      "RWDD3 -- UBE2I\n",
      "RWDD3 -- SUMO1\n",
      "RYR3 -- BMI1\n",
      "RYR3 -- HNF1A\n",
      "RYR3 -- CFTR\n",
      "RYR3 -- CUL1\n",
      "RYR3 -- FKBP1A\n",
      "RYR3 -- RYR2\n",
      "SAPCD1 -- CTNNB1\n",
      "SAPCD1 -- RANGRF\n",
      "SAPCD1 -- ARHGAP23\n",
      "SAPCD1 -- ARHGAP21\n",
      "SAPCD1 -- CTNNA2\n",
      "SAPCD1 -- LNX1\n",
      "SAT2 -- SAT2\n",
      "SAT2 -- KAT2B\n",
      "SAT2 -- VHL\n",
      "SAT2 -- TCEB1\n",
      "SAT2 -- HIF1A\n",
      "SAT2 -- SAT1\n",
      "SBK1 -- SRPK2\n",
      "SBK1 -- PPM1G\n",
      "SBK1 -- FCHSD1\n",
      "SBK1 -- TRIP10\n",
      "SBK1 -- PACSIN3\n",
      "SBK1 -- PACSIN2\n",
      "SCTR -- CYFIP1\n",
      "SCTR -- DNAL4\n",
      "SCTR -- SNTA1\n",
      "SCTR -- CPAMD8\n",
      "SCTR -- ADCYAP1\n",
      "SCTR -- SCT\n",
      "SDK1 -- LGALS8\n",
      "SDK1 -- LGALS3\n",
      "SDK1 -- PRPF40A\n",
      "SDK1 -- MYC\n",
      "SDK1 -- UBC\n",
      "SDK1 -- LNX1\n",
      "SDPR -- FAN1\n",
      "SDPR -- A1CF\n",
      "SDPR -- SDPR\n",
      "SDPR -- NPM1\n",
      "SDPR -- PLEKHF2\n",
      "SDPR -- NUDT18\n",
      "SEC14L4 -- INCA1\n",
      "SEC14L4 -- BMF\n",
      "SEC14L4 -- USHBP1\n",
      "SEC14L4 -- TCF4\n",
      "SEC14L4 -- REL\n",
      "SEC14L4 -- ELAVL1\n",
      "SELO -- HERC2\n",
      "SELO -- PGPEP1\n",
      "SELO -- MRM1\n",
      "SELO -- C4orf29\n",
      "SELO -- C1QTNF2\n",
      "SELO -- METTL20\n",
      "SELV -- PRR20A\n",
      "SELV -- ZMYND19\n",
      "SELV -- ZMIZ2\n",
      "SELV -- APPBP2\n",
      "SELV -- GOLGA2\n",
      "SELV -- PAXIP1\n",
      "SEMA4D -- CRK\n",
      "SEMA4D -- ELAVL1\n",
      "SEMA4D -- PLXNB1\n",
      "SEMA4D -- SEMA4D\n",
      "SEMA4D -- PTPRC\n",
      "SEMA4D -- CD72\n",
      "SGK223 -- CRKL\n",
      "SGK223 -- YWHAE\n",
      "SGK223 -- HSP90AA1\n",
      "SGK223 -- UBE3A\n",
      "SGK223 -- PSAP\n",
      "SGK223 -- CHGB\n",
      "SGK3 -- NEDD4L\n",
      "SGK3 -- HSP90AA1\n",
      "SGK3 -- APP\n",
      "SGK3 -- ITCH\n",
      "SGK3 -- ESR1\n",
      "SGK3 -- GSK3B\n",
      "SH2D3C -- EGFR\n",
      "SH2D3C -- LYN\n",
      "SH2D3C -- NEDD9\n",
      "SH2D3C -- BCAR1\n",
      "SH2D3C -- SNCAIP\n",
      "SH2D3C -- EFS\n",
      "SH3D19 -- NPHP1\n",
      "SH3D19 -- SH3KBP1\n",
      "SH3D19 -- ELAVL1\n",
      "SH3D19 -- CDC42\n",
      "SH3D19 -- GRB2\n",
      "SH3D19 -- SH3YL1\n",
      "SLC16A3 -- TERF2IP\n",
      "SLC16A3 -- TSNAX\n",
      "SLC16A3 -- DIAPH1\n",
      "SLC16A3 -- FAM9B\n",
      "SLC16A3 -- NR2C2AP\n",
      "SLC16A3 -- BANP\n",
      "SLC25A30 -- LOC554223\n",
      "SLC25A30 -- DNAJB11\n",
      "SLC25A30 -- SDF4\n",
      "SLC25A30 -- BTN2A1\n",
      "SLC25A30 -- BSG\n",
      "SLC25A30 -- C4BPB\n",
      "SLC25A48 -- KRTAP10-3\n",
      "SLC25A48 -- KRTAP10-7\n",
      "SLC25A48 -- UBASH3B\n",
      "SLC25A48 -- MID2\n",
      "SLC25A48 -- PNMA1\n",
      "SLC25A48 -- TRAF1\n",
      "SLC41A3 -- CREB3\n",
      "SLC41A3 -- ZACN\n",
      "SLC41A3 -- PDZD3\n",
      "SLC41A3 -- REL\n",
      "SLC41A3 -- APP\n",
      "SLC41A3 -- MAPK6\n",
      "SLN -- SYNE4\n",
      "SLN -- CCDC155\n",
      "SLN -- TMEM79\n",
      "SLN -- ATP2A2\n",
      "SLN -- PLN\n",
      "SLN -- ATP2A1\n",
      "SLX1A -- GRB2\n",
      "SLX1A -- EME1\n",
      "SLX1A -- MUS81\n",
      "SLX1A -- ERCC1\n",
      "SLX1A -- ERCC4\n",
      "SLX1A -- SLX4\n",
      "SMCO4 -- KRTAP10-3\n",
      "SMCO4 -- KRTAP10-7\n",
      "SMCO4 -- SYNE4\n",
      "SMCO4 -- CCDC155\n",
      "SMCO4 -- KRT40\n",
      "SMCO4 -- BNIP3L\n",
      "SNX22 -- CSNK1E\n",
      "SNX22 -- CSNK1A1\n",
      "SNX22 -- B3GALT2\n",
      "SNX22 -- POT1\n",
      "SNX22 -- TERF2\n",
      "SNX22 -- DVL3\n",
      "SNX33 -- MCM2\n",
      "SNX33 -- GLI1\n",
      "SNX33 -- NAF1\n",
      "SNX33 -- FASLG\n",
      "SNX33 -- SNX9\n",
      "SNX33 -- SNX33\n",
      "SOCS7 -- SEPT6\n",
      "SOCS7 -- STAT5A\n",
      "SOCS7 -- STAT3\n",
      "SOCS7 -- SORBS3\n",
      "SOCS7 -- CUL5\n",
      "SOCS7 -- NCK1\n",
      "SP140L -- LDHD\n",
      "SP140L -- TM9SF4\n",
      "SP140L -- RAPGEF2\n",
      "SP140L -- MAGEA1\n",
      "SP140L -- APP\n",
      "SP140L -- NEDD4\n",
      "SRFBP1 -- C10orf12\n",
      "SRFBP1 -- FBXW5\n",
      "SRFBP1 -- DDX10\n",
      "SRFBP1 -- BYSL\n",
      "SRFBP1 -- FBL\n",
      "SRFBP1 -- SRF\n",
      "STAP1 -- CAPZB\n",
      "STAP1 -- CAPZA2\n",
      "STAP1 -- SULT1A1\n",
      "STAP1 -- CD2AP\n",
      "STAP1 -- FAM134C\n",
      "STAP1 -- SH3KBP1\n",
      "STARD7 -- PIGM\n",
      "STARD7 -- TLE3\n",
      "STARD7 -- TLE1\n",
      "STARD7 -- KIAA0907\n",
      "STARD7 -- NAT2\n",
      "STARD7 -- BAG3\n",
      "STARD9 -- MCL1\n",
      "STARD9 -- ABCE1\n",
      "STARD9 -- PPP1CC\n",
      "STARD9 -- SVIL\n",
      "STARD9 -- HERPUD1\n",
      "STARD9 -- CDK5RAP2\n",
      "STRADB -- ELAVL1\n",
      "STRADB -- GRB2\n",
      "STRADB -- STK11\n",
      "STRADB -- XIAP\n",
      "STRADB -- TRAF6\n",
      "STRADB -- MAP3K7\n",
      "STYXL1 -- PSPH\n",
      "STYXL1 -- EHD4\n",
      "STYXL1 -- ATXN10\n",
      "STYXL1 -- RPS29\n",
      "STYXL1 -- SMC1A\n",
      "STYXL1 -- AES\n",
      "SYNGR2 -- FATE1\n",
      "SYNGR2 -- EDNRA\n",
      "SYNGR2 -- GPR52\n",
      "SYNGR2 -- SYNE4\n",
      "SYNGR2 -- SCARA3\n",
      "SYNGR2 -- ATP4A\n",
      "SYTL5 -- CEP70\n",
      "SYTL5 -- WAC\n",
      "SYTL5 -- RAB27B\n",
      "SYTL5 -- RAB6A\n",
      "SYTL5 -- RAB3A\n",
      "SYTL5 -- RAB27A\n",
      "TANC2 -- NR2C2\n",
      "TANC2 -- XPO1\n",
      "TANC2 -- PPP1CA\n",
      "TANC2 -- PPP1CC\n",
      "TANC2 -- YWHAB\n",
      "TANC2 -- LATS2\n",
      "TBC1D10C -- NOTCH2NL\n",
      "TBC1D10C -- KRTAP13-1\n",
      "TBC1D10C -- KLHL12\n",
      "TBC1D10C -- KRTAP5-9\n",
      "TBC1D10C -- HOXA1\n",
      "TBC1D10C -- APP\n",
      "TBRG1 -- ACTR5\n",
      "TBRG1 -- INO80E\n",
      "TBRG1 -- CCDC136\n",
      "TBRG1 -- RALBP1\n",
      "TBRG1 -- RUNDC3A\n",
      "TBRG1 -- MDM2\n",
      "TBX2 -- TEAD2\n",
      "TBX2 -- PML\n",
      "TBX2 -- SOX2\n",
      "TBX2 -- EGR1\n",
      "TBX2 -- LZTR1\n",
      "TBX2 -- CEBPE\n",
      "TESC -- WBP11\n",
      "TESC -- SLC9A1\n",
      "TESC -- DYNLT3\n",
      "TESC -- CCDC91\n",
      "TESC -- RAI1\n",
      "TESC -- HMG20A\n",
      "TEX37 -- DAZAP2\n",
      "TEX37 -- KPNA3\n",
      "TEX37 -- APP\n",
      "TEX37 -- RBPMS\n",
      "TEX37 -- MAGEA11\n",
      "TEX37 -- TRIP13\n",
      "THNSL1 -- FOXD4L6\n",
      "THNSL1 -- TMEFF1\n",
      "THNSL1 -- CCDC74B\n",
      "THNSL1 -- UTP11L\n",
      "THNSL1 -- ICT1\n",
      "THNSL1 -- UIMC1\n",
      "TM9SF1 -- CHMP4B\n",
      "TM9SF1 -- RNASEH1\n",
      "TM9SF1 -- TCOF1\n",
      "TM9SF1 -- P2RX7\n",
      "TM9SF1 -- ATP6V1B1\n",
      "TM9SF1 -- MME\n",
      "TMED7 -- PA2G4\n",
      "TMED7 -- GABRE\n",
      "TMED7 -- TMEM30A\n",
      "TMED7 -- TMED10\n",
      "TMED7 -- TMPRSS3\n",
      "TMED7 -- ELAVL1\n",
      "TMEM120B -- TCTN3\n",
      "TMEM120B -- TCTN2\n",
      "TMEM120B -- CHRNA9\n",
      "TMEM120B -- POMK\n",
      "TMEM120B -- SLC39A4\n",
      "TMEM120B -- CCNDBP1\n",
      "TMEM159 -- FAF2\n",
      "TMEM159 -- ZNF391\n",
      "TMEM159 -- ADCK3\n",
      "TMEM159 -- CACFD1\n",
      "TMEM159 -- GAD2\n",
      "TMEM159 -- ELAVL1\n",
      "TMEM179B -- HTR3C\n",
      "TMEM179B -- FAM189A2\n",
      "TMEM179B -- GPR52\n",
      "TMEM179B -- LGALS3\n",
      "TMEM179B -- HNRNPR\n",
      "TMEM179B -- HNRNPUL1\n",
      "TMEM2 -- TMEM17\n",
      "TMEM2 -- NAAA\n",
      "TMEM2 -- SIAE\n",
      "TMEM2 -- PTCH1\n",
      "TMEM2 -- FBXO6\n",
      "TMEM2 -- ELAVL1\n",
      "TMEM219 -- PON2\n",
      "TMEM219 -- ZACN\n",
      "TMEM219 -- BTNL8\n",
      "TMEM219 -- MCOLN3\n",
      "TMEM219 -- ITM2B\n",
      "TMEM219 -- HLA-DQA1\n",
      "TMEM39B -- CHRNA9\n",
      "TMEM39B -- ISLR\n",
      "TMEM39B -- POMK\n",
      "TMEM39B -- NRG1\n",
      "TMEM39B -- IL13RA1\n",
      "TMEM39B -- UBC\n",
      "TMEM41B -- PPP2CB\n",
      "TMEM41B -- TCTN3\n",
      "TMEM41B -- APOB\n",
      "TMEM41B -- DPYS\n",
      "TMEM41B -- BMI1\n",
      "TMEM41B -- ELAVL1\n",
      "TMEM54 -- CREB3\n",
      "TMEM54 -- RBBP8\n",
      "TMEM54 -- PEX19\n",
      "TMEM54 -- HDAC1\n",
      "TMEM54 -- RARA\n",
      "TMEM54 -- CDK2\n",
      "TMEM97 -- GUK1\n",
      "TMEM97 -- STXBP3\n",
      "TMEM97 -- HLA-DRA\n",
      "TMEM97 -- EGFR\n",
      "TMEM97 -- APP\n",
      "TMEM97 -- ELAVL1\n",
      "TNFRSF10D -- TNFSF10\n",
      "TNFRSF10D -- TRIM28\n",
      "TNFRSF10D -- SF3B3\n",
      "TNFRSF10D -- PFAS\n",
      "TNFRSF10D -- MYH10\n",
      "TNFRSF10D -- LRPPRC\n",
      "TNFRSF17 -- TRAF6\n",
      "TNFRSF17 -- TRAF5\n",
      "TNFRSF17 -- TRAF3\n",
      "TNFRSF17 -- TRAF2\n",
      "TNFRSF17 -- TRAF1\n",
      "TNFRSF17 -- TNFSF13B\n",
      "TPGS2 -- TTLL1\n",
      "TPGS2 -- C11orf49\n",
      "TPGS2 -- ZDHHC17\n",
      "TPGS2 -- NXF1\n",
      "TPGS2 -- MOV10\n",
      "TPGS2 -- EWSR1\n",
      "TPPP -- C2orf27B\n",
      "TPPP -- HIST1H1A\n",
      "TPPP -- CDK11B\n",
      "TPPP -- APP\n",
      "TPPP -- SNCA\n",
      "TPPP -- HDAC6\n",
      "TRIM58 -- UBE2D3\n",
      "TRIM58 -- TRIM58\n",
      "TRIM58 -- DYNC1LI2\n",
      "TRIM58 -- DYNC2LI1\n",
      "TRIM58 -- DYNC1I1\n",
      "TRIM58 -- DYNC1H1\n",
      "TRIM6 -- IKBKE\n",
      "TRIM6 -- TRIM5\n",
      "TRIM6 -- MYC\n",
      "TRIM6 -- TRIM28\n",
      "TRIM6 -- TRIM23\n",
      "TRIM6 -- TRIM6\n",
      "TRMT11 -- PLAUR\n",
      "TRMT11 -- AKR7A3\n",
      "TRMT11 -- TP73\n",
      "TRMT11 -- TP63\n",
      "TRMT11 -- TP53\n",
      "TRMT11 -- WDR48\n",
      "TTC39C -- HSPB1\n",
      "TTC39C -- NXF1\n",
      "TTC39C -- MOV10\n",
      "TTC39C -- SHMT2\n",
      "TTC39C -- ACAT2\n",
      "TTC39C -- THOP1\n",
      "TULP2 -- MTUS2\n",
      "TULP2 -- BRCA1\n",
      "TULP2 -- BARD1\n",
      "TULP2 -- ELAVL1\n",
      "TULP2 -- MEOX2\n",
      "TULP2 -- EWSR1\n",
      "TYSND1 -- XPO1\n",
      "TYSND1 -- TYSND1\n",
      "TYSND1 -- TH\n",
      "TYSND1 -- ACOX1\n",
      "TYSND1 -- PEX5\n",
      "TYSND1 -- JOSD2\n",
      "UAP1L1 -- WDR1\n",
      "UAP1L1 -- OAT\n",
      "UAP1L1 -- SDHB\n",
      "UAP1L1 -- RAB11B\n",
      "UAP1L1 -- PCBD1\n",
      "UAP1L1 -- AFMID\n",
      "UBE3D -- CPSF3\n",
      "UBE3D -- FKBP6\n",
      "UBE3D -- MEMO1\n",
      "UBE3D -- CCNB1\n",
      "UBE3D -- UBE3D\n",
      "UBE3D -- UBE2C\n",
      "UCK2 -- UPRT\n",
      "UCK2 -- CCDC8\n",
      "UCK2 -- EGFR\n",
      "UCK2 -- FBXO6\n",
      "UCK2 -- UPP1\n",
      "UCK2 -- UBC\n",
      "UCKL1 -- BCS1L\n",
      "UCKL1 -- KAT5\n",
      "UCKL1 -- SKAP1\n",
      "UCKL1 -- MPPED1\n",
      "UCKL1 -- UPRT\n",
      "UCKL1 -- CIAO1\n",
      "UEVLD -- UBC\n",
      "UEVLD -- LRSAM1\n",
      "UEVLD -- DTX3\n",
      "UEVLD -- TRAF6\n",
      "UEVLD -- RNF114\n",
      "UEVLD -- RNF4\n",
      "UPRT -- MPPED1\n",
      "UPRT -- UCKL1\n",
      "UPRT -- IRF2BP2\n",
      "UPRT -- UCK2\n",
      "UPRT -- UCK1\n",
      "UPRT -- PYROXD1\n",
      "UTY -- KIF1C\n",
      "UTY -- PCNA\n",
      "UTY -- PRDX2\n",
      "UTY -- NCOA6\n",
      "UTY -- TLE2\n",
      "UTY -- TLE1\n",
      "WBP2NL -- OTUD4\n",
      "WBP2NL -- INO80C\n",
      "WBP2NL -- PCGF6\n",
      "WBP2NL -- ACTR5\n",
      "WBP2NL -- MGA\n",
      "WBP2NL -- FMR1\n",
      "WDR47 -- TCF4\n",
      "WDR47 -- CDK11A\n",
      "WDR47 -- C1orf186\n",
      "WDR47 -- IDS\n",
      "WDR47 -- TCL1A\n",
      "WDR47 -- TCEA2\n",
      "WDR7 -- NTRK1\n",
      "WDR7 -- ATP6V1B1\n",
      "WDR7 -- ROGDI\n",
      "WDR7 -- FRMD6\n",
      "WDR7 -- RAB3GAP1\n",
      "WDR7 -- DMXL2\n",
      "XRCC6BP1 -- HLA-E\n",
      "XRCC6BP1 -- NUP35\n",
      "XRCC6BP1 -- CSPP1\n",
      "XRCC6BP1 -- TRIP6\n",
      "XRCC6BP1 -- AP2B1\n",
      "XRCC6BP1 -- XRCC6\n",
      "XXYLT1 -- FAM63B\n",
      "XXYLT1 -- NXF1\n",
      "XXYLT1 -- MOV10\n",
      "XXYLT1 -- SHMT2\n",
      "XXYLT1 -- CUL4A\n",
      "XXYLT1 -- ELAVL1\n",
      "YBX2 -- RPS2\n",
      "YBX2 -- NIFK\n",
      "YBX2 -- HIST1H1A\n",
      "YBX2 -- HDAC11\n",
      "YBX2 -- ICAM1\n",
      "YBX2 -- IGSF8\n",
      "YIPF4 -- TMEM63B\n",
      "YIPF4 -- UNK\n",
      "YIPF4 -- FAM134C\n",
      "YIPF4 -- RNF185\n",
      "YIPF4 -- FATE1\n",
      "YIPF4 -- YIPF3\n",
      "ZBTB4 -- ZBTB17\n",
      "ZBTB4 -- CBFA2T3\n",
      "ZBTB4 -- TP63\n",
      "ZBTB4 -- HIPK2\n",
      "ZBTB4 -- SIN3B\n",
      "ZBTB4 -- SIN3A\n",
      "ZBTB8B -- PPIP5K1\n",
      "ZBTB8B -- LSM7\n",
      "ZBTB8B -- PPIP5K2\n",
      "ZBTB8B -- CPSF6\n",
      "ZBTB8B -- ILF2\n",
      "ZBTB8B -- KIF5B\n",
      "ZC3H7A -- XPO1\n",
      "ZC3H7A -- NTRK1\n",
      "ZC3H7A -- BIRC7\n",
      "ZC3H7A -- BMI1\n",
      "ZC3H7A -- STK3\n",
      "ZC3H7A -- PAK1\n",
      "ZFP1 -- IPO8\n",
      "ZFP1 -- SERTAD4\n",
      "ZFP1 -- SESN3\n",
      "ZFP1 -- AKR1C2\n",
      "ZFP1 -- CBX5\n",
      "ZFP1 -- HDAC2\n",
      "ZFYVE28 -- PRNP\n",
      "ZFYVE28 -- EGFR\n",
      "ZFYVE28 -- RAB7A\n",
      "ZFYVE28 -- RAB4A\n",
      "ZFYVE28 -- RAB5A\n",
      "ZFYVE28 -- EGF\n",
      "ZNF135 -- GADD45A\n",
      "ZNF135 -- ANXA7\n",
      "ZNF135 -- RCC1\n",
      "ZNF135 -- CDKN1A\n",
      "ZNF135 -- RAP1B\n",
      "ZNF135 -- GSK3B\n",
      "ZNF136 -- KRTAP10-3\n",
      "ZNF136 -- CCNDBP1\n",
      "ZNF136 -- MTUS2\n",
      "ZNF136 -- CEP70\n",
      "ZNF136 -- PPP2R2B\n",
      "ZNF136 -- MDFI\n",
      "ZNF142 -- MCM2\n",
      "ZNF142 -- PTTG1\n",
      "ZNF142 -- MUS81\n",
      "ZNF142 -- NXF1\n",
      "ZNF142 -- CHMP5\n",
      "ZNF142 -- MAPK14\n",
      "ZNF2 -- CCND3\n",
      "ZNF2 -- KRTAP10-7\n",
      "ZNF2 -- TSGA10\n",
      "ZNF2 -- PRMT5\n",
      "ZNF2 -- TRIM28\n",
      "ZNF2 -- APP\n",
      "ZNF202 -- KRTAP10-3\n",
      "ZNF202 -- KRT40\n",
      "ZNF202 -- SNX2\n",
      "ZNF202 -- MZF1\n",
      "ZNF202 -- PCBD1\n",
      "ZNF202 -- ZNF473\n",
      "ZNF227 -- CEP70\n",
      "ZNF227 -- UMPS\n",
      "ZNF227 -- CBX5\n",
      "ZNF227 -- RPS6KA6\n",
      "ZNF227 -- GSK3B\n",
      "ZNF227 -- CSNK1E\n",
      "ZNF230 -- KRT40\n",
      "ZNF230 -- FSD2\n",
      "ZNF230 -- CCDC136\n",
      "ZNF230 -- CCNDBP1\n",
      "ZNF230 -- MDFI\n",
      "ZNF230 -- NDEL1\n",
      "ZNF251 -- MX1\n",
      "ZNF251 -- SMAD1\n",
      "ZNF251 -- PAXIP1\n",
      "ZNF251 -- MDC1\n",
      "ZNF251 -- FEZ2\n",
      "ZNF251 -- FEZ1\n",
      "ZNF26 -- KRTAP10-3\n",
      "ZNF26 -- KRTAP10-7\n",
      "ZNF26 -- KRT40\n",
      "ZNF26 -- TRIM41\n",
      "ZNF26 -- TRIM39\n",
      "ZNF26 -- TP53BP2\n",
      "ZNF273 -- FAM46A\n",
      "ZNF273 -- HDAC1\n",
      "ZNF273 -- ZNF707\n",
      "ZNF273 -- KRTAP10-5\n",
      "ZNF273 -- CA14\n",
      "ZNF273 -- SP8\n",
      "ZNF384 -- TRIP6\n",
      "ZNF384 -- TUBA3C\n",
      "ZNF384 -- SOX2\n",
      "ZNF384 -- OPTN\n",
      "ZNF384 -- HOXC9\n",
      "ZNF384 -- CEBPE\n",
      "ZNF394 -- USP7\n",
      "ZNF394 -- ZSCAN20\n",
      "ZNF394 -- ZNF397\n",
      "ZNF394 -- ZSCAN32\n",
      "ZNF394 -- CCNDBP1\n",
      "ZNF394 -- CLK2\n",
      "ZNF395 -- BTRC\n",
      "ZNF395 -- FBXW11\n",
      "ZNF395 -- WASL\n",
      "ZNF395 -- ELAVL1\n",
      "ZNF395 -- HDAC1\n",
      "ZNF395 -- SAP30\n",
      "ZNF578 -- KRTAP10-3\n",
      "ZNF578 -- KRTAP10-8\n",
      "ZNF578 -- KRTAP10-9\n",
      "ZNF578 -- KRTAP10-7\n",
      "ZNF578 -- CEP70\n",
      "ZNF578 -- MDFI\n",
      "ZNF580 -- ARHGEF6\n",
      "ZNF580 -- SH3GL2\n",
      "ZNF580 -- XBP1\n",
      "ZNF580 -- PAX9\n",
      "ZNF580 -- RAD54B\n",
      "ZNF580 -- TSC22D4\n",
      "ZNF625 -- KRTAP10-3\n",
      "ZNF625 -- KRTAP10-9\n",
      "ZNF625 -- KRTAP10-7\n",
      "ZNF625 -- KRTAP10-4\n",
      "ZNF625 -- KRT40\n",
      "ZNF625 -- CBX5\n",
      "ZNF629 -- IPO8\n",
      "ZNF629 -- HIST1H2BG\n",
      "ZNF629 -- NTRK1\n",
      "ZNF629 -- FBL\n",
      "ZNF629 -- RPSA\n",
      "ZNF629 -- RPL14\n",
      "ZNF645 -- SRSF10\n",
      "ZNF645 -- SERTAD4\n",
      "ZNF645 -- ZC3H13\n",
      "ZNF645 -- WTAP\n",
      "ZNF645 -- PPP2R2D\n",
      "ZNF645 -- KIAA1429\n",
      "ZNF71 -- SSX2IP\n",
      "ZNF71 -- RIN3\n",
      "ZNF71 -- KDM1A\n",
      "ZNF71 -- PLK1\n",
      "ZNF71 -- PRKCZ\n",
      "ZNF71 -- CSNK2B\n",
      "ZNF747 -- APP\n",
      "ZNF747 -- ZNF707\n",
      "ZNF747 -- APPBP2\n",
      "ZNF747 -- CBX5\n",
      "ZNF747 -- ELAVL1\n",
      "ZNF747 -- SUFU\n",
      "ZNF775 -- ZAK\n",
      "ZNF775 -- MAPK6\n",
      "ZNF775 -- FES\n",
      "ZNF775 -- RPS6KA5\n",
      "ZNF775 -- OSGEP\n",
      "ZNF775 -- PPP2CB\n",
      "ZNF8 -- HIST1H2BG\n",
      "ZNF8 -- NXF1\n",
      "ZNF8 -- SHMT2\n",
      "ZNF8 -- CBX5\n",
      "ZNF8 -- CBX3\n",
      "ZNF8 -- SMARCAD1\n",
      "ZNF800 -- CNTROB\n",
      "ZNF800 -- VPS16\n",
      "ZNF800 -- TM9SF4\n",
      "ZNF800 -- PRR11\n",
      "ZNF800 -- NPM1\n",
      "ZNF800 -- ELAVL1\n",
      "ZNRF2P1 -- KRTAP10-3\n",
      "ZNRF2P1 -- KRT40\n",
      "ZNRF2P1 -- USHBP1\n",
      "ZNRF2P1 -- CCNDBP1\n",
      "ZNRF2P1 -- KRT31\n",
      "ZNRF2P1 -- HNRNPK\n",
      "ZUFSP -- TCEAL1\n",
      "ZUFSP -- SHMT2\n",
      "ZUFSP -- RPS21\n",
      "ZUFSP -- PRMT5\n",
      "ZUFSP -- CLN8\n",
      "ZUFSP -- SHCBP1\n"
     ]
    }
   ],
   "source": [
    "## Plan of attack:\n",
    "## * Get all nodes with 6 degrees\n",
    "## * For each of these: fetch neighbours\n",
    "## * Put those gene names in an array\n",
    "## * Sort that array\n",
    "## * If the same array appears 7 times: is clique of 7\n",
    "nodes_with_6_degrees = graph_db.cypher.execute(\n",
    "    \"MATCH (n:Gene) \\\n",
    "     WITH n, size((n)--()) AS degree \\\n",
    "     WHERE degree = 6 \\\n",
    "     RETURN n\")\n",
    "node_names = map(lambda x:x[0].properties['name'], nodes_with_6_degrees)\n",
    "for node_name in node_names:\n",
    "    linked_nodes = graph_db.cypher.execute(''.join([\"MATCH (n {name: '\", node_name, \"'})--(m:Gene) RETURN m\"]))\n",
    "    if len(linked_nodes) == 6:\n",
    "        for ln in linked_nodes:\n",
    "            print(' -- '.join([node_name, ln[0].properties['name']]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
